{"id":4020,"date":"2019-03-13T05:10:22","date_gmt":"2019-03-13T04:10:22","guid":{"rendered":"http:\/\/www.betensured.com\/blog\/?p=4020"},"modified":"2020-06-22T03:29:55","modified_gmt":"2020-06-22T02:29:55","slug":"betting-terms","status":"publish","type":"post","link":"https:\/\/www.betensured.com\/blog\/betting-terms\/","title":{"rendered":"Betting Terms &#8211; The Complete Sports Betting Terms"},"content":{"rendered":"<p><a href=\"https:\/\/www.betensured.com\">As a Football Prediction Site, <\/a>we know <a href=\"http:\/\/www.betensured.com\/blog\/football-betting-guide\/\">soccer betting<\/a> is hard but it can get harder if you are not familiar with your betting terms<\/p>\n<p>What Betensured hopes to achieve is to collect a complete list of the <strong>A-Z of betting terms<\/strong> that will help both the pro and the layman stay in the know.<\/p>\n<p>Think of it as a cross between The Oxford English and Urban Dictionary, with a bit of forum lingo thrown in so you always know what&#8217;s happening.<\/p>\n<p><strong>200 Sports Betting Terms You Should Be Familiar With<\/strong><\/p>\n<p><strong>1<\/strong><\/p>\n<ul>\n<li><strong>1&#215;2<\/strong><br \/>\n<a href=\"https:\/\/www.betensured.com\/blog\/10-experts-shared-best-betting-tips\/\">1&#215;2 betting<\/a> is a term used to refer to the possible outcomes of a football match &#8211; or any other sport that includes the possibility of a draw at the end of match completion. &#8220;1&#8221; refers to the &#8220;Home&#8221; team winning, &#8220;X&#8221; refers to the &#8220;Draw&#8221; being the case and &#8220;2&#8221; refers to the &#8220;Away&#8221; team winning.<\/li>\n<\/ul>\n<p><strong>A<\/strong><\/p>\n<ul>\n<li><strong>Accumulator<\/strong><br \/>\nA single wager made up of multiple selections. The outcomes of each must be correct for a payment to be made. Odds are multiplied for each selection meaning that big wins can be made from small wagers, but it becomes increasingly unlikely the more selections are made.<strong>Also known as:<\/strong>&#8216;<em>Acca<\/em>&#8216; or &#8216;<em>Multiple<\/em>&#8216;<br \/>\n<strong>See also:<\/strong> Multiples<\/li>\n<li><strong>Action<\/strong><br \/>\nAction is an american term that refers to <a href=\"https:\/\/www.pinnacle.com\/en\/betting-articles\/Baseball\/ultimate-baseball-betting-guide\/JU3J9V9HPREQ3VMS\">baseball betting<\/a>, where a certain starting pitcher must be present in the starting lineup for the bet to stand or &#8216;see action&#8217;. Starting pitcher requirements usually only apply to moneyline bets.If you bet on a moneyline selection with a starting pitcher requirement and the pitcher does not start \/ there is a pitcher change, the bet is usually &#8216;pushed&#8217; (stake is returned to you and the bet is void).The reason for action only being seen if the starting pitcher starts is that the starting pitcher in a game of baseball can greatly affect the outcome of the game and so a change of pitcher can result in a large change in odds for the team affected.As a general rule, if you see a pitcher&#8217;s name listed next to a moneyline bet, you should assume that the bet you are placing will be subject to &#8216;starting pitcher&#8217; rules regarding whether the bet sees action or not. As always, see the terms and conditions of the bookmaker&#8217;s site for confirmation of this &#8211; usually terms relating to baseball will be listed under a &#8216;Rules&#8217; or &#8216;Sports betting rules&#8217; section of the terms and conditions pages.Occasionally there will be the option to choose between two types of bet &#8211; pitcher (usually the pitcher&#8217;s name will be listed &#8211; eg &#8216;Doe, J&#8217; for a starting pitcher called &#8216;John Doe&#8217;) or no pitcher. If you select the no pitcher option then the bet stands no matter whether the listed starting pitcher starts the game or not &#8211; the odds for this selection are usually adjusted to account for this, or they are similar to the &#8216;SP&#8217; horse racing bet type whereby the price of the bet is only applied at the start of the baseball game when it&#8217;s known which pitchers are starting.Starting pitcher requirements on baseball betting is most common on US sportsbetting sites. Many European betting sites will not list the starting pitchers at all, no matter which pitcher starts, the bet will stand.Starting pitcher requirements can be a potential hazard for matched bettors, since if bets are placed on the moneyline for both teams at different bookmakers but then one team&#8217;s designated starting pitcher fails to start, that bet will be voided\/pushed but the other bet will still stand. Therefore the remaining bet stake that sees &#8216;action&#8217; is left &#8216;at risk&#8217; \/ is not &#8216;hedged&#8217; unless a new bet is struck to replace the voided bet.<\/li>\n<li><strong>Advantage Play<\/strong><br \/>\nGambling with the odds stacked in your favour, be it from enhanced odds, promotional bonuses, refunds on losses or &#8220;what if&#8221; results.<\/li>\n<li><strong>Against the spread (ATS)<\/strong><br \/>\nA wager placed against the handicap.Similar to &#8216;beating the spread&#8217; &#8211; a term used to describe a team or player beating the handicap that was applied to them. For example, if you bet on Atlanta to beat Cincinnati with an 8.5 point spread and Atlanta won the game by 10 points, you would say that Atlanta &#8216;beat the spread&#8217; (since they scored 10 points &#8211; 1.5 points more than the 8.5 spread).<strong>See also:<\/strong>Handicap and Spread Betting<\/li>\n<li><strong>After Timing<\/strong><br \/>\nTaking credit for (or boasting about) predicting a result correctly after the event has finished, without having mentioned the prediction prior to the start of the event. Quite often a technique employed by tipsters to make it appear that they are more successful than they really are &#8211; ie posting a string of apparently successful results after the event has finished, despite having never posted these &#8216;picks&#8217; prior to the start of the event (so the veracity of these so-called picks cannot be verified).<\/li>\n<\/ul>\n<ul>\n<li><strong>All in<\/strong><br \/>\nPoker term &#8211; &#8220;to go all in&#8221; is to bet all your chips on the result of a single hand. Derives from the physical action of moving all of one&#8217;s chips in to the middle of the table\/pot in a poker game to indicate you wish to bet everything on the hand.Also known as &#8216;shoving&#8217;.<\/li>\n<li><strong>Alphabet<\/strong><br \/>\nA combination bet over six selections comprised of 26 separate bets in the form of two Patents, a Yankee and an Accumulator.<\/li>\n<li><strong>American Odds<\/strong><br \/>\nA method of displaying odds as either positive (better than Evens) or negative (less than Evens) based on the return of a 100 unit wager.Example: fractional odds of 4\/1 (decimal &#8216;5&#8217;) would be displayed in American Odds as +400 since a 100 unit wager would result in a payout of 400 units.Fractional odds of 1\/4 on (decimal 1.25) would be displayed as -400, since a wager of 400 units would result in a payout of 100 units.<strong>Also known as:<\/strong>&#8216;<em>Vegas Odds or Moneyline Odds<\/em>&#8216;<br \/>\n<strong>See also:<\/strong> Decimal Odds and Fractional Odds<\/li>\n<li><strong>Ante<\/strong><br \/>\nA forced\/mandatory bet in poker used to get the betting started on each hand, most commonly towards the end of a tournament to make the pot sizes larger and to stimulate more aggressive play.Also refers to a side bet in three card poker.<\/li>\n<li><strong>Ante post<\/strong><br \/>\nA horse racing bet placed before all the runners are confirmed in a race. If your horse does not run then your bet still stands UNLESS the bookie has confirmed NRNB (no runner no bet), which they sometimes do on larger races.Ante post betting can present a welcome bonus for APers &#8211; if the horse you backed is declared a non-runner and the bet is voided on the bookie side (ie stakes are refunded) but you layed the bet off at an exchange, the lay bet will still stand and as a result you will receive the lay bet winnings without incurring any back bet loss.<strong>See also: <\/strong>Non Runner<\/li>\n<li><strong>Anytime scorer<\/strong><br \/>\nA wager placed on a player to score at any time during a game of football.<strong>See also:<\/strong>First Goal Scorer<\/li>\n<\/ul>\n<ul>\n<li><strong>Arbitrage<\/strong><br \/>\nThe practice of buying something at one price and selling it at a higher price at more or less the same time to make a quick locked in profit with little or no risk.The term has been coined by APers to refer to the process of backing a selection at a bookmaker at one price and then laying the same bet off at a betting exchange at a lower price in such a way that no matter what happens, a profit (or at worse, no loss) is made.Arbitrage opportunities often come as a result of a steam movement on a line: when a book doesn&#8217;t move the line quick enough, it becomes possible to back the bet at the bookmaker at a high price and simultaneously lay off the same bet at a lower price for a locked in profit.The concept of &#8216;arbitrage&#8217; has been around for a long time since it&#8217;s really quite an abstract &#8216;system&#8217;, but the earliest recorded instances of it being used to exploit financial systems are back around the time of the introduction of steam trains and later on telegraphy systems.&#8221;Tech savvy&#8221;(!) arbitrage traders back in the day would exploit the &#8216;lag&#8217; involved in prices being updated on one side of America after they had been changed on the other side of America. For example, if the price in beans changed on the East coast of America and an individual could somehow relay that information on to a counterpart in the West coast quicker than the market could be updated in the West, the counterpart in the West coast could buy or sell quickly, wait for the price to change, and then trade out of the position for a profit.<strong>Also known as:<\/strong>&#8216;<em>Arb<\/em>&#8216;<br \/>\n<strong>See also:<\/strong> Sharbing<\/li>\n<li><strong>Asian Handicap<\/strong><br \/>\nNamed for its Eastern origin, an Asian handicap reduces the number of lines on a (possibly draw resulting) sporting event from 3 (win, lose, draw) to just 2 (win, lose) by assigning a handicap of a number of goals to one side. This simplifies the betting options to two outcomes with near 50% chance of success on each.The number of goals or points applied as the handicap can be full, half, or quarter:<\/p>\n<ul>\n<li>In a <strong>full handicap<\/strong>, a full goal or point is applied as handicap.<\/li>\n<li>In a <strong>half handicap<\/strong>, a half goal or point is applied as handicap.<\/li>\n<li>In a <strong>quarter handicap<\/strong>, the bet stake is effectively split in two, with half the bet stake placed on a full goal\/point handicap bet and the other half bet stake placed on a half goal\/point handicap bet.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>All asian handicaps are a transformation of one of the above options with the goal \/ point handicaps incremented by one goal\/point (ie (+\/-)0, +\/-0.25, +\/-0.5, +\/-0.75, +\/-1, +\/-1.25, etc).<\/p>\n<p>The notation for asian handicapping bets is as follows:<\/p>\n<ul>\n<li><strong>Full handicap:<\/strong>1AH(1) or 1AH(-1)<br \/>\nRefers to a full goal advantage (1 or +1) or handicap (-1) applied to team 1.Note, a &#8216;special case&#8217; of full goal handicap is the &#8216;zero&#8217; goal &#8211; 1AH(0) &#8211; handicap, whereby if a game is drawn, all bets on the zero goal handicap are &#8216;pushed&#8217; (ie stakes are returned). 1AH(0) can be dutched with bets on the draw and team 2 to win to &#8216;lock in&#8217; a return (be careful though, a specialized calculation is required, it is not the same as dutching plain &#8216;1&#215;2&#8217;).1AH(0) is the same as betting on the Draw No Bet \/ DNB bet type. Also known as &#8216;Moneyline&#8217; in US betting parlance (although some vendors such as Pinnacle may supply both moneyline and AH(0) offerings).<\/li>\n<li><strong>Half handicap: <\/strong>1AH(0.5) or 1AH(-0.5)<br \/>\nRefers to a half goal advantage (0.5, sometimes denoted +0.5) or handicap (-0.5) applied to team 1 (although confusingly on Asian handicap specialist sites, the handicapped side is often just referred to as &#8216;0.5&#8217; &#8211; ie when you bet on that you are betting on that selection with a handicap of -0.5).1AH(0.5) is the same as betting on the European Handicap 1EH(1) or on the 1X &#8216;second chance&#8217; bet type. 1AH(0.5) can be &#8216;dutched&#8217; against a regular bet on Team 2.<\/li>\n<li><strong>Quarter handicap:<\/strong>1AH(0.25) or 1AH(-0.25)<br \/>\nRefers to a bet where the stake is split, with half the stake bet on 1AH(0) and half the stake bet on 1AH(0.5). The two parts of the bet are effectively settled as one at the price you bet at.With the quarter handicap, if you bet on 1AH(0.25) (ANY quarter bet handicap) and the result is a draw, half your stake will be pushed (stake returned to you) and half will win. If you bet on 1AH(0.25) and team 1 wins, you win both &#8216;parts&#8217; of the quarter handicap bet.Note &#8211; quarter handicaps include 0.75 as well which is a bet where half the bet is placed on the 0.5 handicap and half on the 1 handicap.<\/li>\n<\/ul>\n<p>Invariably with a true asian handicap specialist you will never see odds straying outside of 1.5 to 3 decimal because the handicap is adjusted so as to make the two possible outcomes as equal as possible (which is after all the point of an asian handicap!). If the odds drift too far away from evens, it is more common for a proper\/true asian specialist to move the handicap rather than (just) the line\/odds. Often you can see hilarious &#8216;faux&#8217; asian odds on European sites where the odds are miles away from evens (ie 1.1 vs 8) &#8211; European bookmakers are generally poor at offering Asian handicaps and this can be a rich vein occasionally for the arb hunter.<\/p>\n<p><strong>Also known as:<\/strong> &#8216;<em>Handicap Betting, Spread Betting<\/em>&#8216;<\/p>\n<p><strong>See also:<\/strong> Middles<\/p>\n<p><strong>B<\/strong><\/p>\n<ul>\n<li><strong>Back<\/strong><br \/>\nBetting on a particular outcome.<strong>See also:<\/strong>Lay<\/li>\n<li><strong>Bad beat<\/strong><br \/>\nA tough loss, normally in poker, where one is statistically the strong favourite to win the hand but then goes on to lose as a result of another weaker player hitting a lucky card\/street.Also known as &#8216;sucking out&#8217;.<\/li>\n<li><strong>Back \/ Lay Spread<\/strong><br \/>\nThe back lay spread is a term used to describe the difference in price between the back and lay prices within a market on a betting exchange. The larger the back lay spread, the more costly it is to trade out of an opening position for a profit or &#8211; to put it another way &#8211; the longer it will take for a queued bet to be matched.<strong>See also:<\/strong>Bid Offer Spread<\/li>\n<li><strong>Bag (as in &#8220;A Bag&#8221;)<\/strong><br \/>\nCockney rhyming slang for £1,000. Also known as &#8216;a long one&#8217;, &#8216;gripper&#8217; or &#8216;banana&#8217;.Example: I&#8217;m garn daahhhn ter the bloomin&#8217; bookmaker ter put a bag dahn on a Charin&#8217; Cross. (thanks to the Cockney Rhyming Slang Translator)<\/li>\n<li><strong>Banker<\/strong><br \/>\nA very short priced favourite. A bet which is expected to win with some certainty. Often used as part of a Full Cover bet.<strong>See also: <\/strong>Full Cover Bet<\/li>\n<li><strong>Bankroll<\/strong><br \/>\nThe amount of money you have available to place bets with. Standard procedure is to have this in a separate account, normally an e-wallet.As a professional gambler your &#8216;bankroll&#8217; may not necessarily (indeed, should most certainly NOT!) be the full amount that you risk in any one session of gambling. For example, in poker it is common to organize your bankroll in such a way that you only ever take 1-5% of your full bankroll to a table to play with (which in turn is a function of the table limits). The reasons for this are so that one can &#8216;ride out&#8217; the variance involved in gambling (ie although someone may be technically better than others at poker, it is prudent to allow for the inevitable ups and downs involved by playing with a limited bankroll that is a small proportion of your total bankroll so as not to &#8217;tilt&#8217;).Similar principles apply to Sportsbetting and Casino wagering.<strong>See also:<\/strong>e-wallet<\/li>\n<li><strong>Basic Blackjack Strategy<\/strong><br \/>\nAn optimal strategy for playing Blackjack whereby a minimal loss can be expected all things being equal. The strategy is completely legitimate and simply comprises a set of &#8216;what if&#8217; decisions to make based on the cards you are dealt versus the card(s) that the dealer is dealt. .<\/li>\n<li><strong>Beginners Luck<\/strong><br \/>\nThe phenomenon whereby a new player\/gambler etc has greater success than expected.<strong>See also:<\/strong>Luck<\/li>\n<li><strong>BetfairX<\/strong><br \/>\nExchange commission rebate scheme only available at TheGamblingTimes. Get 10% of all commission paid on Exchange bets paid to you automatically as a rebate by TGT every month for 3 years.<\/li>\n<li><strong>Binary Betting \/ Binary Odds<\/strong><br \/>\nBinary betting relates to bets placed on a binary market. A binary market offers selections or bets where there are just two (hence the term &#8216;binary&#8217;) distinct results, win or lose.Binary odds are displayed on a scale from 0 to 100, with the odds roughly equating to the probability of the outcome occuring (with 0 being the price on an outcome that will not happen and 100 being the price on an outcome that is certain to happen).Bets are placed on a binary market by either buying or selling &#8216;points&#8217; on the market &#8211; so for example if the BUY price on a binary market is 40 and you bet £1 per point on the market (your stake is 40*£1=£40), you stand to win £100 if the bet wins (so a profit of the winning amount &#8211; £100 &#8211; less the initial stake &#8211; £40 &#8211; which equals £60). Alternatively if you SELL at £1 per point at the same price of 40 (your stake here is £1*(100-40)=£60), and the selection wins, you will lose your £60 stake.The &#8216;converse&#8217; to the example above &#8211; if the selection loses, your BUY bet will lose (you lose £40), but your SELL bet will win £100 (so your profit on the market is £100-£60=£40).A betting exchange is based on the principles of binary betting, each selection within a market can either win or lose and individuals can bet with one another on whether each selection within each market will win or lose (backing and laying respectively). BUYing and SELLing on a binary market also interchanges with backing and laying on an exchange.<\/li>\n<li><strong>Burlington Bertie<\/strong><br \/>\nTic Tac term for odds of 100\/30.<\/li>\n<li><strong>Best Odds Guaranteed<\/strong><br \/>\nA promotional offer on horse racing whereby the bookmaker promises to pay out on your horse racing bet at the start price if that price is higher than the price that you took the bet at originally.Example: you bet on a horse at 2\/1 but the price of the horse when the race started was 3\/1 &#8211; if the bookmaker offers &#8220;Best Odds Guaranteed&#8221; then you will be paid out at 3\/1 instead of just 2\/1.<strong>Also known as:<\/strong><em>BOG<\/em><\/li>\n<li><strong>Betting<\/strong><br \/>\nThe placing of wagers on the outcome of events.<\/li>\n<li><strong>Betting exchange<\/strong><br \/>\nOrganisations that allow customers to bet and take bets against each other such as Betfair, BetDaq and Smarkets.<\/li>\n<li><strong>Betting Strategy<\/strong><br \/>\nA method or system employed to attain a specific result within betting activity &#8211; usually to win!Since all gaming operators work on the principle of vig\/house edge\/overround, most betting strategies employed by punters are not likely to succeed in the short to medium term. Even with strategies that, in theory at least, are profitable in the long term (such as the Martingale system), in reality even these strategies are destined to fail because the amount of time and money required to see a long term profit is vast.The only way to ensure long term profits is to play with an advantage of some sort &#8211; eg making use of promotional bonuses that are offered by gaming operators to effectively improve the odds or increase the value of the lines that are offered.<\/li>\n<li><strong>Bid Offer Spread<\/strong><br \/>\nThe difference between the bid price (selling) and offer price (buying), normally for a commodity or equity.<strong>See also:<\/strong>Back \/ Lay Spread<\/li>\n<li><strong>Big player<\/strong><br \/>\nAnyone that places large wagers.<strong>See also:<\/strong>Whale<\/li>\n<li><strong>Bingo<\/strong><br \/>\nGame of chance involving the drawing of numbers. Expression of delight.<\/li>\n<li><strong>BitCoin<\/strong><br \/>\nA crypto currency used as a way of making payments with some operators online. The currency currently suffers wild fluctuations in value that make it a risky investment. Also, by its nature, it is unregulated and doesn&#8217;t offer security of funds at many of the operators offering BitCoin betting.<strong>See also:<\/strong>Regulation<\/li>\n<li><strong>Bonus<\/strong><br \/>\nExtra amount provided on deposit to an account.<\/li>\n<li><strong>Book<\/strong><br \/>\nA book is a set of bets laid \/ offered on an event. For example in the case of a tennis match, a book on the match result will consist of just two bets &#8211; one for the first player to win and one for the second player to win.If a book covers every single possible outcome on an event, it is said to be &#8220;complete&#8221;.If a complete book is balanced in such a way that the bookmaker makes a profit no matter what the result is, the book is said to be a &#8220;green book&#8221;. Contrast &#8220;red book&#8221;.Betting exchanges make it a trivial option for anyone to become a bookmaker.<strong>See also:<\/strong>Bookmaker<br \/>\n<strong>See also:<\/strong> Greening Up<\/li>\n<li><strong>Bookmaker<\/strong><br \/>\nAny person or company prepared to take wagers on events (normally sporting) at agreed odds.<strong>Also known as:<\/strong>&#8216;<em>Turf Accountant or Bookie or Gaming Operator<\/em>&#8216;<\/li>\n<li><strong>Bore Draw<\/strong><br \/>\nA match (usually football) where the end result is 0-0.<strong>See also:<\/strong>Ifbets<\/li>\n<li><strong>Box or Box Betting<\/strong><br \/>\nPlacing a box means to take all permutations of Exacta, Trifecta etc. for a given number of options. For instance an Exacta box with two numbers, known as a Quinella, would provide a win for A first and B second, or B first and A second.Also known as &#8216;System bets&#8217;.<strong>See also:<\/strong>Quinella<\/li>\n<li><strong>Breaking the bank<\/strong><br \/>\nWinning more money than the house (casino) has available to pay you. Plausible in Bricks and Mortar casinos, not so much online.<\/li>\n<li><strong>Bricks and Mortar<\/strong><br \/>\nA gaming operator \/ bookmaker \/ casino that is based in a physical building (made of &#8216;bricks and mortar&#8217;!) as opposed to an online only gaming operator.<\/li>\n<li><strong>Bustomatic<\/strong><br \/>\nA term coined by APers for the advanced strategy of attempting to &#8216;bust out&#8217; a bonus on the very first bet (thus completing the wagering requirement) or else make an enhanced profit from that first bet which will then go to covering any losses incurred on later wagering.The term originated around the time when US books used to offer very generous &#8216;continuous&#8217; &#8216;re-up&#8217; bonuses, where you got a bonus every time you deposited. The WR on these bonuses used to be relatively high, so the best way of approaching it was to attempt to bust out your full balance on the very first bet.By &#8216;knocking together&#8217; two similar US books where you had bonuses at both, you could easily get a good run going where you had bonus after bonus within days of each other across just those two books, busting alternatively from one book to another, to another, etc, reloading for new bonuses continuously. Heady days.Example: a bookie has a bonus of 100% to £100 with a 5x deposit+bonus WR &#8211; one might employ the bustomatic strategy by underlaying the first &#8216;full balance&#8217; (£200) bet heavily.In this way you would either make a smaller profit of £50 if the first bet loses (in which case no further wagering is required) or else make a much larger profit if it wins (in which case the full 5x(D+B) WR must be completed, but this enhanced profit compensates you for having to spend the time and effort in completing the WR and helps to cover any losses incurred in completing the WR).<strong>See also:<\/strong>Wagering Requirement<br \/>\n<strong>See also:<\/strong> Betting Strategy<br \/>\n<strong>See also:<\/strong> Expected Value<\/li>\n<\/ul>\n<p><strong>C<\/strong><\/p>\n<ul>\n<li><strong>Canadian<\/strong><br \/>\nSee Super Yankee.<\/li>\n<li><strong>Canbet<\/strong><br \/>\nAn Australian bookmaker, regulated by the <a href=\"https:\/\/www.gamblingcommission.gov.uk\/news-action-and-statistics\/Match-fixing-and-sports-integrity\/Sports-Betting-Intelligence-Unit.aspx\" target=\"_blank\" rel=\"noopener noreferrer\">Gambling Commission<\/a> in the UK, that at the end of 2013 stopped honouring withdrawals back to customer accounts; first citing system and then funding issues. As of February 2014 many customers are still trying to extract their money back from Canbet.<strong>See also:<\/strong>Regulation<\/li>\n<li><strong>Carpet<\/strong><br \/>\nOdds of 3\/1.<strong>See also:<\/strong>Double Carpet<\/li>\n<li><strong>Cash in<\/strong><br \/>\nTo take reduced odds before or during the event after the odds have moved in your favour. Also to withdraw your funds from a casino.<strong>See also:<\/strong>Greening Up<br \/>\n<strong>See also:<\/strong> Trading<\/li>\n<li><strong>Casino<\/strong><br \/>\nA gaming operator which offers gambling games on which wagers can be made such as slots, video poker and blackjack.<\/li>\n<li><strong>Chase<\/strong><br \/>\nTo place more wagers in the hope of recovering from previous losses.<strong>See also:<\/strong>Degenerate and End of the day betting<\/li>\n<li><strong>Cheltmas<\/strong><br \/>\nThe special feeling that all your betting dreams have come true during the Cheltenham Festival. A period of celebration when the volume of offers available makes value betting and advantage play ever more profitable.<\/li>\n<li><strong>Churn<\/strong><br \/>\nTo churn through a wagering requirement by betting and re-betting money, often using low risk betting.<strong>See also:<\/strong> Grinding<\/li>\n<li><strong>Cold deck<\/strong><br \/>\nA situation, normally in a Bricks and Mortar casino, where the house is having a good run and players are losing. Opposite of a Hot Deck.<\/li>\n<li><strong>Commission<\/strong><br \/>\nPayments made to the agents of transactions, relevant to betting exchanges where the odds are set by the customers themselves.Betting exchanges allow individuals to place bets for and against an outcome, with other individuals. Importantly bets are NOT struck with the exchange, and so to make a profit the exchange charges commission on all profit that players make from exchange activity. In this way, no matter what the outcome of an event, the betting exchange always turns a profit (since when one person loses, another one always wins and has to pay commission on their profit).<\/li>\n<li><strong>Comps<\/strong><br \/>\nShort for &#8216;complementary gifts&#8217;. Gifts given to gamblers in an effort to keep them gambling. Notable in Las Vegas for providing everything from rooms to limousines, to keep the Whales coming back. Some online casinos also offer comps (in the form of &#8216;comp points&#8217;) based on the value of wagers placed, which can then later be exchanged for gifts or cashback.<\/li>\n<li><strong>Correct score<\/strong><br \/>\nA wager placed on the exact outcome of a sporting event, for instance 1-0, or 2-1, etc.<\/li>\n<li><strong>Counting<\/strong><br \/>\nA Betting Strategy which exploits the fact that some games can be said to have &#8216;memory&#8217; as a result of there being some kind of limitation on the randomness of the game (ie the use of the same deck of cards to play more than one hand, after each hand is played, the remaining cards in the deck become more predictable).Usually this technique applies to card games which use a limited number of cards (say a single pack of cards), since cards that are &#8216;seen&#8217; on the table can be noted or &#8216;counted&#8217; by the player in such a way that future cards that are yet to be dealt can be predicted with better probability.Historically used to great effect by teams of counters in Las Vegas Bricks and Mortar Casinos, but important to note is that the technicque is not (usually) possible wth online casinos where they (effectively) use a new deck of cards for each and every hand that is dealt.<\/li>\n<\/ul>\n<p><strong>D<\/strong><\/p>\n<ul>\n<li><strong>Dead heat<\/strong><br \/>\nA tie or a draw &#8211; most commonly in horse racing &#8211; where two or more competitors cannot be separated on the line by any means available. Winnings are normally paid out on all winners, but against half (or one third for three tied etc) the original stake.<\/li>\n<li><strong>Decimal Odds<\/strong><br \/>\nAn odds display notation where the quoted odds reflect what would be paid out <strong>in total<\/strong>to the bettor if they win.Example: if a £10 bet at odds of 2.0 decimal wins, you will receive £10*2.0 = £20 back as winnings &#8211; ie the stake is included in the winnings, your profit would be £10.Decimal odds are equal to the fractional odds plus one.Example: fractional odds of 1\/1 (Evens) would be displayed in decimal as 1\/1 + 1 = 2.0. Fractiontal odds of 10\/11 would be displayed in decimal as 10\/11 + 1 = 0.91 (recurring) + 1 = 1.91.Decimal odds are also known as &#8220;European&#8221; odds (in contrast to &#8220;English&#8221; (Fractional) odds) &#8211; decimal odds are often denoted as &#8216;EU&#8217; on bookmaking sites where the option exists to change the odds display (again, in contrast to &#8216;EN&#8217; for Fracional\/English odds).<strong>See also:<\/strong> American Odds and Fractional Odds<\/li>\n<li><strong>Degenerate<\/strong><br \/>\nA compulsive gambler, mug.<strong>See also:<\/strong>Mugging<\/li>\n<li><strong>Double Carpet<\/strong><br \/>\nTic Tac term for odds of 33\/1, a single Carpet is 3\/1.<\/li>\n<li><strong>Double Up<\/strong><br \/>\nDoubling your stake after a loss.More commonly, in AP parlance, refers to the strategy of target betting whereby one would attempt to double up your balance very quickly and then grind out the rest of a wagering requirement.In blackjack, to double up means to place a side bet on a hand whereby if you win, you receive double the profit &#8211; see Basic Blackjack Strategy.<strong>Also known as:<\/strong>&#8216;<em>Double or Nothing or Double or Quits<\/em>&#8216;<br \/>\n<strong>See also:<\/strong> Target Betting<\/li>\n<li><strong>Draw<\/strong><br \/>\nA match that finishes even \/ with both teams or sides scoring the same number of &#8216;points&#8217;.<strong>See also:<\/strong>1X2<br \/>\n<strong>See also:<\/strong> Dead Heat<br \/>\n<strong>See also:<\/strong> Push<\/li>\n<li><strong>Draw No Bet<\/strong><br \/>\nA bet type where the stake is returned if the event bet on is a draw. Similar to a 1&#215;2 bet, but without the draw &#8211; if the match ends in a draw, stakes are returned to the bettor.The DNB bet type is a special case of spread bet where a goal handicap of zero is added to the team that is bet on &#8211; therefore if the score is a draw, when the handicap of zero is applied, the score is still a draw and the bet is &#8216;pushed&#8217; (stakes are returned).<strong>See also:<\/strong>1&#215;2<br \/>\n<strong>See also:<\/strong> Moneyline<br \/>\n<strong>See also:<\/strong> Asian Handicap<\/li>\n<li><strong>Drift<\/strong><br \/>\nWhere the odds on an outcome lengthen. Like a canal barge (or a speedboat close to the off!).<strong>See also:<\/strong>Lengthen<br \/>\n<strong>See also:<\/strong> Steam<\/li>\n<li><strong>Dutching<\/strong><br \/>\nPlacing two (or more) back bets on opposing sides of an event to ensure a profit from them no matter what the result. The most common way to &#8216;dutch&#8217; a back bet on TeamA is to either back TeamB +0.5 goals at another bookmaker, or to back the Draw and TeamB at different bookmakers &#8211; in all cases, all possible outcomes are &#8216;covered&#8217;.The process of dutching often equates to &#8216;creating a book&#8217; on an event, since the aim of dutching is invariable to cover every single possible outcome so that no matter what the result, an equal profit or loss is made. This is essentially the definition of a &#8216;complete book&#8217; or &#8216;complete market&#8217;.Asian handicapping lines can offer extra value when dutching. Taking advantage of the extremely tight handicap lines offered by asian books, one can &#8216;lay off&#8217; a &#8216;1&#8217; or &#8216;2&#8217; bet (ie a back bet on one team or another) by dutching it with a bet on the draw, plus another bet on the other team to win with a handicap applied. Common dutches of this kind involve 1 X 2(0) and 1 X 2(+\/-0.25), although many other bets involving AH can be applied to dutch off back bets.<strong>See also:<\/strong>AH<br \/>\n<strong>See also:<\/strong> Book<\/li>\n<\/ul>\n<p><strong>E<\/strong><\/p>\n<ul>\n<li><strong>Each way<\/strong><br \/>\nA wager made up of two bets, one to win and one to place. The win bet is only paid if the selection wins. The place bet will give a return dependent on where it finished and how many places are paid (normally the more entrants to an event the more places will be paid). The odds on the place will be expressed as a fraction of the win odds.<\/li>\n<li><strong>Edge<\/strong><br \/>\nThe profit that the house expects to make on a game. The edge is calculated by subtracting the expected return from 100. Different games have a different edge. Blackjack has a very low house edge (approximately 0.5%), whereas slot machines have a very high edge (varies widely from 5-20%). Contrast the edge for the National Lottery in the UK which is said to be close to a massive 50% (although to be fair a considerable amount of the &#8216;house take&#8217; from the lottery does go to good causes).<strong>See also:<\/strong>House Edge, Expected Value (EV) and Variance<\/li>\n<li><strong>End of the day betting<\/strong><br \/>\nThe placing of large wagers at the end of a gambling session to make up for previous losses.<strong>See also:<\/strong>Chasing<\/li>\n<li><strong>European Handicap<\/strong><br \/>\nEuropean Handicapping (EH) is a method of applying a handicap to one team so as to level the possible outcome of the match. European Handicaps apply a one or more goal handicap to one team so that the playing field is &#8216;levelled&#8217;.Example: a 1 goal handicap is applied to Team 1 so the possible outcomes are: 1EH-1, X, 2.There are three possible outcomes with the handicap applied:Team1 wins by two goals or more (2-0, 3-1, etc)- handicap result: 1(EH-1) wins (since the score once the handicap is applied is 1-0, 2-1, etc).<br \/>\nTeam1 wins by exactly one goal (1-0, 2-1, etc) &#8211; handicap result: X (since the score once the handicap is applied is 0-0, 1-1, etc).<br \/>\nThe game is drawn (0-0, 1-1, etc) &#8211; handicap result: Team2 wins (since the score once the handicap is applied is -1-0, 0-1, etc).<strong>See also:<\/strong> Asian Handicap<\/li>\n<li><strong>Even Money<\/strong><br \/>\nOdds of 1\/1 (fractional) or 2.0 (decimal). Also known as &#8220;Evens&#8221;, &#8220;Level&#8221; and &#8220;Major Stevens&#8221;.<\/li>\n<li><strong>E-wallet<\/strong><br \/>\nAn online money transfer account. Skrill is the ewallet service of choice for the APer at this point in time.See the guides below for a lot more information about ewallet usage in relation to gaming.<strong>See also:<\/strong>Skrill<br \/>\n<strong>See also:<\/strong> Neteller<\/li>\n<li><strong>Exacta<\/strong><br \/>\nA wager placed on the outcome of an event, normally a horse race, where the first and second places must be predicted in the correct order.<strong>See also:<\/strong>Box Betting<\/li>\n<li><strong>Exchange<\/strong><br \/>\nSee Betting Exchanges.<\/li>\n<li><strong>Expected Value \/ EV<\/strong><br \/>\nThe expected return from a series of wagers. Used to calculate the house edge and potential profitability of offers from casinos or bookmakers. An endeavour (ie a bonus campaign you are planning to start out on) that is +EV (&#8220;plus EV&#8221;) is, statistically speaking, likely to be profitable in the long term.<strong>See also:<\/strong>Variance<\/li>\n<li><strong>Exposure<\/strong><br \/>\nThe amount of money you have at risk (ie could potentially lose) in a given market.<strong>See also:<\/strong>Liability<\/li>\n<\/ul>\n<p><strong>F<\/strong><\/p>\n<ul>\n<li><strong>Favourite<\/strong><br \/>\nThe participant with the shortest odds &#8211; not necessarily the best chance of winning though as the amounts staked on an event will also have a bearing on the odds offered.<\/li>\n<li><strong>First Goal Scorer<\/strong><br \/>\nA bet on which player will be the first goal scorer in a game of football. Your selection must score the opening goal to win.Many bookmakers also include the selection &#8216;No first goalscorer&#8217; to make the book complete. In matched metting, &#8216;No goalscorer&#8217; bets can be laid off at an exchange on the correct score market (by laying &#8216;0-0&#8217;). This can present a unique (albeit very rare) APing &#8216;bonus&#8217; &#8211; many bookmakers will void bets on &#8216;no goalscorer&#8217; if the first goal scored is an own goal. If you have layed &#8216;no goalscorer&#8217; on the Correct Score market (by laying &#8216;0-0&#8217;), your lay bet will win, but your back bet will have been voided (or &#8216;pushed&#8217;), so your profit for the event is the total of your lay stake on the market &#8211; effectively hitting a &#8216;half middle&#8217;.<strong>See also:<\/strong>Anytime Scorer<br \/>\n<strong>See also:<\/strong> Half Middle<\/li>\n<li><strong>Fix<\/strong><br \/>\nAny event where someone has altered the outcome to ensure a specific result, this can be incredibly profitable for anyone placing wagers on the outcome.<strong>See also:<\/strong>Spot Fixing<\/li>\n<li><strong>Fixed odds<\/strong><br \/>\nThe odds at the time you make your wager are the odds that you receive. In contrast \/ for comparison, a bet placed at odds of &#8216;SP&#8217; on a horse race will be settled at the odds on the horse at the time the horse race started.The term &#8216;Fixed Odds&#8217; is also used on sites that offer both spread betting like offerings, as well as &#8216;regular&#8217; betting options &#8211; often the spread based markets will be labelled &#8216;Binary&#8217; whereas the &#8216;normal&#8217; or &#8216;regular&#8217; betting markets will be labelled &#8216;Fixed Odds&#8217;.<strong>See also:<\/strong>Starting Price<br \/>\n<strong>See also:<\/strong> Binary Odds<\/li>\n<li><strong>Fixed Odds Betting Terminal<\/strong><br \/>\nA machine, normaly found in high street bookmakers, that allow the play of casino and slot games with bets accepted of up to £100.<\/li>\n<li><strong>Flutter<\/strong><br \/>\nA small wager placed on an event you have an interest in. Usually placed with little overall knowledge of the event, for instance the Grand National.<\/li>\n<li><strong>Forecast<\/strong><br \/>\nThe British term for an Exacta (see definition of Exactafor more information).<strong>See also:<\/strong> Exacta and Quinella<\/li>\n<li><strong>Form<\/strong><br \/>\nA guide to past performance. Past performance is no guarantee of future performance though, and, of course, form is temporary and class is permanent.<\/li>\n<li><strong>Forum<\/strong><br \/>\nPlace of discussion, there&#8217;s no better one than The Gambling Times Forum.<\/li>\n<li><strong>Fractional Odds<\/strong><br \/>\nMethod of displaying possible returns from wagers based on the number of units staked. The bettor receives a return of their stake in addition to the odds*stake shown. Odds greater than even are read or spoken &#8216;x to y&#8217; (for odds of x\/y) &#8211; odds less than even are read or spoken &#8216;x to y on&#8217; (for odds of y\/x).For example, a bet of £10 at odds of 2\/1 (read\/spoken as &#8220;two to one&#8221;) would return £30 (£20 win + £10 stake returned). Odds of 1\/4 (read\/spoken as &#8220;four to one on&#8221;) would return £12.50 for the same £10 stake (£2.50 win + £10 stake returned).Fractional odds are also known as &#8220;English Odds&#8221; because the use of fractional odds begain in England.On many bookmaker sites, one has the option to change the odds display to Fractional by selecting &#8216;EN&#8217; from the &#8216;odds display&#8217; settings (compare this to &#8216;EU&#8217; for European (ie decimal) odds and &#8216;US&#8217; for American Odds &#8211; other odds formats include Malay, where odds are always expressed in decimal numbers under + or &#8211; 1 &#8211; ie +0.4 in Malay odds = 1.4 in decimal, 2\/5 in Fractional and -250 in American).<strong>See also:<\/strong>Decimal Odds and American Odds<\/li>\n<li><strong>Free Bet<\/strong><br \/>\nA &#8216;free bet&#8217; is a promotional device used by gaming operators to induce individuals to play at their outlets. Most commonly a free bet or bets will be given to individuals after completing a certain wagering requirement &#8211; for example &#8216;deposit and spend £100 to get a £100 free bet&#8217;.From the gaming operator&#8217;s perspective, the ultimate hope is that in the process of completing the wagering requirement, the individual will lose more than the value of the free bet and thus will represent a profitable situation for the operator.In contrast, the Advantage Player or Matched Bettor will attempt to extract the value of the free bet with as little loss as possible by strategically placing matched bets (backing at the bookmaker and laying the bets off at an exchange).Free bets are commonly referred to as &#8216;stake not returned&#8217; or &#8216;SNR&#8217; free bets. Free bets are usually applied to an individual&#8217;s account as a &#8216;virtual&#8217; entity &#8211; if the bet wins, only the winnings are returned to the individual, the value of the stake is not returned as normally would be the case with a regular bet.As a result, when laying off an SNR free bet it is important to underlay your bet to compensate for the fact that the stake is not returned (in essence this equates to laying off the bet at &#8216;odds-1&#8217;).The value of an SNR free bet is best extracted at longer odds (if they are being &#8216;matched off&#8217; or &#8216;layed off&#8217; at an exchange to extract their value). The reason for this can be best seen by doing &#8216;what if&#8217; scenarios with free bets \/ lay bets at different odds &#8211; for example do a &#8216;what if&#8217; scenario for a free bet at odds of 1.5 with lay odds of 1.5, then compare the results to the same free bet placed at odds of 10 with lay odds of 10. At at longer odds, the percentage of the free bet you can expect to get back as profit is much greater than at shorter odds.Very occasionally, &#8216;free bets&#8217; will be applied to an account as non-SNR. Commonly this kind of free bet is referred to as a &#8216;Stake Returned&#8217; or &#8216;SR&#8217; free bet (since if you bet with the bonus amount, your stake will be returned to you with your winnings if your bet wins). In effect this kind of promotional bonus is simply an account credit &#8211; no underlay is required with this kind of free bet (although usually an additional wagering requirement will apply to the bonus amount so it may still be beneficial to underlay the first bet after you receive an SR free bet).Occasionally free bets will be awarded as a refund if your bet loses. In this case, you place the bet as &#8216;normal&#8217; with your own cash balance and if the bet loses, the operator will refund you the stake as an account credit. It is generally best to treat these kinds of bets the same as SNR free bets &#8211; ie back\/lay at long odds and underlay.<strong>See also:<\/strong>Underlaying<br \/>\n<strong>See also:<\/strong> Bustomatic Matched Betting Technique (for SR free bets)<\/li>\n<li><strong>Full Cover Bet<\/strong><br \/>\nA wager containing all permutations of doubles, trebles and accumulators for a given number of selections. Full cover bets include Trixie, Yankee, Canadian or Super Yankee, Heinz, Super Heinz and Goliath bets for full cover bets containing 3, 4, &#8230;, 8 selections respectively. Note: a &#8220;Double&#8221; accumulator bet (one containing just two selections, both have to win for the Double to win) is just a full cover bet with only two selections.<\/li>\n<li><strong>Furlongs<\/strong><br \/>\nThe unit used to express distances over which horses run. One furlong is equal to one eighth of a mile or 660 feet. There are five furlongs to a kilometre.<\/li>\n<\/ul>\n<p><strong>G<\/strong><\/p>\n<ul>\n<li><strong>Gambler&#8217;s Conceit<\/strong><br \/>\nThe false knowledge of an individual who believes they are able to stop gambling, whilst still engaging in it.<strong>See also:<\/strong>Quit while you&#8217;re ahead<\/li>\n<li><strong>Gambler&#8217;s Fallacy<\/strong><br \/>\nThe belief that independent events have, in some sense, a memory. For examle &#8211; a belief that a series of heads on the flip of a coin means a series of tails is more likely to follow (which is not true, since every coin toss is independent of every other coin toss, no one single coin toss can influence future coin tosses so there is no reason to believe that a series of heads should make it more likely that tails are due to be tossed).<strong>See also:<\/strong>Monte Carlo Fallacy<\/li>\n<li><strong>Gambling<\/strong><br \/>\nPlacing a wager or bet for a selection within an event to succeed.<strong>See also:<\/strong>Mugging.<\/li>\n<li><strong>GamCare<\/strong><br \/>\nAn independent service providing help for people dealing with gambling addiction, either themselves or people they know.<strong>See also:<\/strong>GamCare Website.<\/li>\n<li><strong>Gnoming<\/strong><br \/>\nThe action of setting up multiple accounts at the same gaming operator under different people&#8217;s names \/ using different identities, usually with the intention of obtaining multiple bonuses (when the terms of the bonus explicitly state only one bonus per person or household).Also known as &#8216;multi accounting&#8217;, &#8216;PF&#8217; (for &#8220;partner friendly&#8221;) or &#8216;OH&#8217; (for &#8220;other half&#8221; &#8211; ie partner\/spouse\/wife\/girlfriend\/boyfriend etc).<strong>See also:<\/strong>TGT Site Policy on Multiple Accounting \/ Gnoming<br \/>\n<strong>See also:<\/strong> TGT Acceptable User Policy<\/li>\n<li><strong>Goliath<\/strong><br \/>\nA combination bet over eight selections giving 247 separate bets. 28 doubles, 56 trebles, 70 fourfolds, 56 fivefolds, 28 sixfolds, 8 sevenfolds and an eightfold accumulator.<\/li>\n<li><strong>Greening Up<\/strong><br \/>\nThe act of hedging your bets at the end of a trading session so that you make the same profit no matter whether you win or lose. &#8220;Greening&#8221; refers to the colour that the Betfair exchange &#8216;what if&#8217; indicators turn to indicate what happens if a certain outcome within an event occurs &#8211; when you are &#8216;greened up&#8217;, every possible outcome is green, and life is just good.<strong>See also:<\/strong>Trading<br \/>\n<strong>See also:<\/strong> Hedging<\/li>\n<li><strong>Grinding<\/strong><br \/>\nThe act of monotonously\/tediously playing a game with the sole purpose of completing a wagering requirement of some kind. Used especially in reference to poker playing, although appropriated by the Advantage Play community to refer to the act of &#8216;grinding&#8217; through a wagering requirement &#8211; especially a casino WR where a very large WR is in play and the strategy being employed is to place minimum risk, low stake bets in order to complete the WR with as little loss as possible.<strong>See also:<\/strong>Wagering Requirement<br \/>\n<strong>See also:<\/strong> House Edge, Expected Value (EV) and Variance<\/li>\n<li><strong>Gubbing<\/strong><br \/>\nThe process by which a bookmaker will limit an account which consistently wins or where a player bets only on their least profitable lines \/ steam lines.The term &#8216;gubbing&#8217; originally referred to the process of losing an &#8216;odds on&#8217; bet &#8211; ie betting on something at 1.01 and losing &#8211; &#8216;he took a gubbing&#8217; &#8211; but has since been coined by Matched Bettors to refer to the process of being severely limited by a bookmaker.<strong>See also:<\/strong>Bonus Abuser<br \/>\n<strong>See also:<\/strong> Steam Lines<br \/>\n<strong>See also:<\/strong> Shubbing<\/li>\n<\/ul>\n<p><strong>H<\/strong><\/p>\n<ul>\n<li><strong>Half Time \/ Full Time<\/strong><br \/>\nAlso known as &#8216;HT\/FT&#8217;.A wager placed on a football match where the objective is to correctly determine who will win the first and second halves of the match (regular time only). There are a total of 9 possible HT\/FT outcomes: 1\/1, 1\/X, 1\/2, X\/1, X\/X, X\/2, 2\/1, 2\/X and 2\/2 &#8211; where 1 is the home team, X is the draw and 2 is the away team.Example: &#8216;1\/X&#8217; would refer to a bet on the match where Team 1 (the home team) leads at the end of the first half but the match ends in a draw at the end of full time.Alternative notation is for the full names of the participant teams to be listed in the selection names &#8211; so for example if Man Utd were playing Arsenal, one might see the listings: Man Utd \/ Man Utd (Man Utd lead at the end of both halves), Man Utd \/ Draw (Man Utd win first half, full time result is a draw, Man Utd \/ Arsenal (Man Utd to lead at half time, Arsenal to win at the end of full time), etc etc.1\/1 and 2\/2 must not be confused with Correct Score market results like 1-1 or 2-2 (end score of &#8216;one all&#8217; or &#8216;two all&#8217;). Also not to be confused with bets on &#8216;second chance&#8217; &#8216;pseudo&#8217; asian handicap markets (where 1X means a bet on either team 1 or the draw happening).HT\/FT bets can also be the cause of great confusion when compared with the bet offering &#8216;To Win Both Halves&#8217; (which is a bet that effectively treats both halves of a football match as separate events). It is an error to believe that &#8216;1\/1&#8217; is the same as &#8216;Team 1 to win both halves&#8217;, this is NOT the case. Any temptation to bet on what looks like an arb on the &#8216;to win both halves&#8217; market (by backing a &#8216;to win both halves&#8217; bet at a bookmaker and laying it off on the HT\/FT market) should be avoided at all costs.Why? Take the following example:You bet on Team1 to win both halves and lay the bet off by laying 1\/1 on the HT\/FT market.Team 1 win the first half by 2 goals (half time score: 2-0) and Team 2 go on to score the only goal of the second half (full time score: 2-1). In this case, whilst Team 1 won the first half, and continued to win at the end of full time (so a bet on 1\/1 would have won), in actual fact a bet on &#8220;Team 1 to win both halves&#8221; would have lost (since Team 2 scored the only goal of the second half). In this case you would lose the &#8216;to win both halves&#8217; bet AND lose the 1\/1 lay bet.<\/li>\n<li><strong>Handicap<\/strong><br \/>\nA way of levelling a sporting event by applying a handicap of some sort (points or goals) to the starting position of the stronger team (one team starts a goal down for example) and adjusting the odds accordingly.Handicaps can be applied using a European or Asian methodology (respectively known as &#8220;European Handicap&#8221; (EH) and &#8220;Asian Handicap&#8221; (AH)).Handicaps can be applied to any sport which uses a points based system.Variations include Spread Betting and Asian Handicaps.<strong>See also:<\/strong>Spread Betting<br \/>\n<strong>See also:<\/strong> Asian Handicap<br \/>\n<strong>See also:<\/strong> European Handicap<\/li>\n<li><strong>Hedging<\/strong><br \/>\nThe process of reducing potential losses or gains. In practice this can be the locking in of a profit following the movement in the betting market, or taking a small loss instead of riding out a result.The term &#8216;hedging your bets&#8217; in day to day language (to describe an action taken to cover yourself in the event that two different outcomes happen) originates from this.<\/li>\n<li><strong>Heinz<\/strong><br \/>\nCombination bet over six selections providing: 15 doubles, 20 trebles, 15 fourfolds, 6 fivefolds and a sixfold accumulator.<\/li>\n<li><strong>High Roller<\/strong><br \/>\nAlso Big Player or Whale. Someone who places large wagers, the opposite of a Low Roller.<\/li>\n<li><strong>Hot Deck \/ Table<\/strong><br \/>\nA temporary situation where the cards are in favour of the player and they are winning. Whilst possible in theory when playing live (although limited by frequent shuffling) these terms cannot be applied to a random number generator at an online casino.<strong>See also:<\/strong>Gambler&#8217;s Fallacy<br \/>\n<strong>See also:<\/strong> Cold Deck<\/li>\n<li><strong>House<\/strong><br \/>\nThe taker of wagers on casino games.<strong>See also:<\/strong>Bricks and Mortar<\/li>\n<li><strong>House Edge \/ House Advantage<\/strong><br \/>\nThe margin built into a game by which a casino will take their profit. Although beatable in individual instances or short periods, the house will always win in the end over a very large number of bets, all things being equal.House Edge can be minimized by utilizing an optimal strategy (also known as &#8216;Basic Strategy&#8217;) such that if there is a decision to be made, an optimal play can be made so as to minimize the overall House Edge over time. From this, it follows that the house edge is increased where individuals are not aware of basic \/ optimal strategy.The House Edge varies from one game to another &#8211; the HE of a few types of games (highest HE to lowest HE, assuming optimal play) are as follows: lottery, bingo, slots, video poker, roulette, blackjack, baccarat, craps.<strong>See also:<\/strong>House Edge and Expected Value<br \/>\n<strong>See also:<\/strong> Basic Blackjack Strategy<br \/>\n<strong>See also:<\/strong> Vig<\/li>\n<\/ul>\n<p><strong>I<\/strong><\/p>\n<ul>\n<li><strong>IBAS<\/strong><br \/>\nThe Independent Betting Adjudication Service. A third party service for settling disputes between customers and IBAS registered companies in the UK.<\/li>\n<li><strong>Ifbets<\/strong><br \/>\nPromotional offers offered by bookmakers of the format &#8220;if x happens, get y&#8221;, where x is usually a conditional occurence in an event (such as a team losing or a certain scoreline happening &#8211; usually 0-0) and y is usually a refund of all losing bets.Simple ifbets like &#8216;get a refund if your bet loses&#8217; (importantly with NO other criteria attached) can be treated the same as &#8216;stake not returned&#8217; free bets &#8211; for all intents and purposes, your qualifying &#8216;ifbet&#8217; here is a &#8216;free bet&#8217; since if it loses you simply get your bet stake back.Example: If Man City beat Chelsea, get a refund on all losing correct score bets &#8211; in this case if you bet that Chelsea would win 1-0, but Man City then went on to beat Chelsea, you would receive your stake back as a refund.<strong>See also:<\/strong>Bore Draw<\/li>\n<li><strong>In Play \/ In Running<\/strong><br \/>\nPlacing wagers whilst the event is in progress.<\/li>\n<\/ul>\n<p><strong>J<\/strong><\/p>\n<ul>\n<li><strong>Juice<\/strong><br \/>\nThe amount of take the bookmaker will make from an event, usually by merit of the fact that the book that has been built is balanced in such a way that no matter who wins, the bookmaker will make a profit.Juice is most commonly used in US bookmaking terminology and is interchangeable with &#8216;Vig&#8217; or &#8216;Overround&#8217;.<strong>See also:<\/strong>Vig<\/li>\n<\/ul>\n<p><strong>K<\/strong><\/p>\n<ul>\n<li><strong>Kicks<\/strong><br \/>\nAs in football &#8216;corner&#8217; kicks. Wagers can be placed Over or Under the expected number, or within specific ranges.<\/li>\n<li><strong>Kite<\/strong><br \/>\nSlang for a cheque.<\/li>\n<\/ul>\n<p><strong>L<\/strong><\/p>\n<ul>\n<li><strong>Lay<\/strong><br \/>\nTo lay odds on a selection within an event.To strike a bet with an individual who believes that an outcome within an event will occur (when you believe the outcome will not occur). The person who accepts your bet accepts a &#8216;back&#8217; bet. You are &#8216;laying&#8217; that back bet.To take a position that something won&#8217;t happen.<strong>See also:<\/strong> Lay Liability<\/li>\n<li><strong>Lengthen<\/strong><br \/>\nTerm for the increase in odds where something becomes increasingly unlikely.<strong>See also:<\/strong>Drift<\/li>\n<li><strong>Liability \/ Lay Liability \/ Lay Liability Sharing<\/strong><br \/>\nPotential losses on a market. In simple terms, the amount of money you expect to lose (or have to pay out) if the bet you have backed (or laid) loses (or wins, in the case of a lay bet).Lay liability is the total amount you will lose if a bet you have laid then goes on to win. Lay liability is equivalent to the amount of money that the person that backed your bet will win (over and above their initial stake) &#8211; so for example if you lay a bet at decimal odds of 2 that Man Utd will not win and someone backs that bet with you (they accept or &#8216;strike&#8217; the bet with you) for a stake of £100, your lay liability is £100 (since if Man Utd lose, you will have to pay out £100 to the person that won the bet).Lay liability can become quite complicated &#8211; but is also very ueful to the professional matched bettor &#8211; in the case that you are laying more than one selection in the same event\/market, since the amount that you will potentially lose on the market differs depending on which selection wins. However the total lay liability for a market is always the largest amount you can expect to pay out to a single individual selection within the market.Example: if you have a lay bet of £100 on Man Utd at 2.0, plus a lay bet on the Draw of £100 at 3.5, then your total liability for that market is £250 because the largest amount you can expect to have to pay out on a single individual selection in the market is £250 (ie if the match ends in a Draw you will have to pay out £250).This concept is commonly referred to as &#8216;liability sharing&#8217; and has a number of positive benefits:Firstly it means that you can lay many bets on different selections within the same market so long as the total lay liability (refer to description above) does not exceed your current exchange balance. Additionally, for each extra selection you lay within a market, as long as the lay liability of that selection is lower than the current maximum liability in the market, no extra money needs to be &#8216;ringfenced&#8217; from your main exchange balance. This is very ueful if you have a number of bets on different horses within a horse race and you need to lay them all off &#8211; by using the same exchange, you can lay them all off and your total liability on the market will only be as much as the largest liability of any single horse in the race.Another advantage of liability sharing is that you can avoid paying any exchange commission if one of the horses you laid does go on to win (so long as the lay liability of that horse was larger than the largest lay stake of all the other horses you laid in the market). In the case that the lay liability is not larger than the largest lay stake of all the other lay bets in the market, you would still see a reduced commission bill (since your total profit for that market will have been reduced by the amount you had to pay out in lay liability on the horse that won).<\/li>\n<li><strong>Limit \/ Win Limits<\/strong><br \/>\nThe amount you are permitted to wager on an event. Limits can be placed on low profit lines by bookmakers, or on lines that are part of a special promotional offer.Limits can also be placed on accounts to effectively bar the customer from future wagers at that bookmaker, usually an action taken as part of a &#8216;business decision&#8217; to no longer accept custom from an individual.<strong>See also:<\/strong>Gubbing and Shubbing<\/li>\n<li><strong>Line<\/strong><br \/>\nA specific selection or outcome within an event that a bookmaker offers a price on for gamblers to bet on. Most commonly used \/ originated in US sportsbetting parlance.Example: in a 1&#215;2 event such as football, the &#8220;1&#8221; (ie Home), &#8220;X&#8221; (Draw) and &#8220;2&#8221; (Away) outcomes \/ selections are 3 different &#8216;lines&#8217; that a bookmaker might lay bets on \/ accept bets for.<strong>See also:<\/strong>Making A Book<\/li>\n<li><strong>Liquidity<\/strong><br \/>\nThe amount of money available to back or lay on a betting exchange market.Markets with a lot of money available to back\/lay are &#8216;high liquidity&#8217; markets (vice versa for &#8216;low liquidity&#8217;).Highly liquid markets will usually have a smaller back\/lay spread due to the tendency for individuals betting within the market wanting to be &#8216;matched&#8217; quickly. Conversely, lower liquidity markets tend to be very slow since there isn&#8217;t enough demand\/supply of money for bets to be matched quickly.<strong>See also:<\/strong>Betting Exchanges<\/li>\n<li><strong>Longshot<\/strong><br \/>\nA bet at very long odds on a selection that is statistically unlikely to win.<\/li>\n<li><strong>Lottery<\/strong><br \/>\nA game of luck where requiring no skill where all participants have an equal chance of winning.<\/li>\n<li><strong>Low Roller<\/strong><br \/>\nSomeone who plays for low stakes, the opposite of a High Roller or Whale.<\/li>\n<li><strong>Luck<\/strong><br \/>\nA cruel mistress and not to be trusted.Luck and Variance are often mistaken for one another as a result of the innate human propensity to find order in chaos &#8211; usually in an attempt to exert some degree of control over an uncontrollable situation, or to make believe that we are in control to a greater extent than we really are.This being the case, it is not uncommon for people to believe that the next spin will be more likely than not to be black simply because red has come up 5 times in succession on a roulette table. This is not the case &#8211; each spin is independent of every other spin and as such the likelihood of a red or a black being spun is the same from one spin to another (this is commonly referred to as the &#8220;Gambler&#8217;s Fallacy&#8221;).Over a large enough sample \/ number of spins, the number of reds and blacks will tend to be equal &#8211; however the &#8216;order&#8217; in which they turn up (ie variability) cannot be predicted with any degree of certainty based upon a knowledge of past results. If you bet on red, and red comes in, you have won as a result of luck (barring any convoluted series of magnets under the table of course  ).<strong>See also:<\/strong>Gambler&#8217;s Fallacy<br \/>\n<strong>See also:<\/strong> Variance<\/li>\n<li><strong>Lucky 15<\/strong><br \/>\nCombination bet over four selections providing; 4 singles, 6 doubles, 4 trebles and a fourfold accumulator. Also available as Lucky 31 (five selections) and Lucky 63 (six selections).<\/li>\n<\/ul>\n<p><strong>M<\/strong><\/p>\n<ul>\n<li><strong>Making A Book<\/strong><br \/>\nLaying multiple bets on one event, in theory creating a profit regardless of the outcome of the event. Being a bookmaker.If a book covers every selection or line within an event, the book is said to be &#8220;complete&#8221;.If a book is made in such a way that no matter what the outcome, a profit is assured, the book is said to be a &#8220;green book&#8221;.<\/li>\n<li><strong>Market Maker<\/strong><br \/>\nSomeone who has both sides of a financial equation and hopes to make a profit regardless of the result.An individual involved in providing liquidity to a market &#8211; in relation to gambling, this usually refers to one ore more individuals who actively place and take bets on a market on a betting exchange in large volumes, usually traders who trade on a market with the intention of greening up \/ making a profit no matter what the result.<strong>See also:<\/strong>Trading<br \/>\n<strong>See also:<\/strong> Liquidity<br \/>\n<strong>See also:<\/strong> Greening Up<\/li>\n<li><strong>Martingale Strategy<\/strong><br \/>\nA Betting Strategy where by the wager is doubled for each loss that occurs. In theory this will guarantee a profit of the original stake when a win occurs. In practice this would require an unlimited bankroll and corresponding table limits.<\/li>\n<li><strong>Match Bets<\/strong><br \/>\nPlacing wagers on the result of a match. You bet on either Team A to win, Team B to win, or you bet on the Draw.<\/li>\n<li><strong>Matched Bet<\/strong><br \/>\nAn accepted wager i.e. matched with someone willing to take (or lay) it. Usually refers to a bet that is &#8216;taken&#8217; or &#8216;accepted&#8217; on a betting exchange (bets are usually listed as &#8216;matched&#8217; and &#8216;unmatched&#8217; on a betting exchange).<\/li>\n<li><strong>Matched Betting<\/strong><br \/>\nThe process of wagering on either side of a result so you have a back bet FOR the result, and also a lay bet AGAINST the result. Doing this can create action or turnover at a bookmaker with no (or minimal) loss.A technique used to take advantage of (ie extract the value of) &#8220;free bets&#8221; without the normal risk associated with placing a bet (whereby you would normally lose the value of your stake if your bet loses &#8211; in matched <a href=\"http:\/\/www.betensured.com\/blog\/matched-betting-a-beginners-guide\/\">betting,<\/a> if your back bet loses, your lay bet will win, so your net loss is minimal).<strong>See also:<\/strong>Free Bets<\/li>\n<li><strong>Middle \/ Half Middle<\/strong><br \/>\nA result whereby two different but coincidental bets both win, providing an enhanced profit. Primarily used to refer to scoreline (over\/under) betting in basketball, although can also refer to spread betting in basketball or any other sport that involves scorelines or spreads.Example: you bet on over 99.5 points on a basketball match at BookA and under 101.5 points on the same match at BookB. The resulting score is 100 points, so you have &#8216;hit the middle&#8217; &#8211; both bets win at the same time since 100 points is over 99.5 and also under 101.5 points. Very (very) happy days.Related terms are &#8220;Half Middle&#8221; which refers to a situation where one of the bets wins, but the other bet is &#8216;pushed&#8217; (you receive the stake back as a refund). Half middles are most common with sport spreads bets where bets are pushed if the spread condition is hit exactly.Example: you bet on TeamA to win with a +7 point advantage and TeamB to win with a -6.5 point advantage. The result of the match is that TeamB wins by exactly 7 points, so you have &#8216;hit a half middle&#8217; &#8211; your TeamA bet is pushed (you receive that stake back), but your TeamB bet has won.<strong>See also:<\/strong>Handicap<br \/>\n<strong>See also:<\/strong> Asian Handicap<br \/>\n<strong>See also:<\/strong> Against The Spread<br \/>\n<strong>See also:<\/strong> Spread Betting<\/li>\n<li><strong>Miraclebet<\/strong><br \/>\nA situation where due to the difference of opinion of bookmakers a player can place wagers on each outcome and guarantee a profit regardless of the result.<strong>See also:<\/strong>Arbitrage<\/li>\n<li><strong>Moneybookers<\/strong><br \/>\nFormer name of E-Wallet provider Skrill.<strong>See also:<\/strong>Skrill<\/li>\n<li><strong>Moneyline Odds<\/strong><br \/>\nPrimarily an American term, Moneyline odds refer to a bet on either one team or another to win, with the draw option excluded. Most commonly used in basketball where the draw is extremely unlikely to occur (or impossible to occur, depending on the league).Effectively the same as the European &#8216;draw no bet&#8217; bet-type (common in soccer\/football betting) or the Asian Handicap &#8216;AH(0)&#8217; bet type (one team or another to win with a zero goal asian handicap applied &#8211; ie if the result is a draw, bets are pushed \/ stakes are returned, &#8216;action&#8217; is only seen if one team or the other wins).Moneyline bets are most commonly used in reference to bets placed on one team or another to win in basketball, baseball and ice hockey games\/matches.Moneyline selections are usually referred to by &#8217;12&#8217; (ie you can bet on Team1 or Team2 only) &#8211; contrast this to a &#8216;1&#215;2&#8217; bet-type where you can bet on Team1 to win, Team2 to win, or for a Draw to be the case.<strong>See also:<\/strong>1X2 Bet Type<br \/>\n<strong>See also:<\/strong> Asian Handicap<br \/>\n<strong>See also:<\/strong> Spreads<\/li>\n<li><strong>Monkey<\/strong><br \/>\nSlang for £500.<\/li>\n<li><strong>Monte Carlo Fallacy<\/strong><br \/>\nAn example of the Gamblers Fallacy where in 1913 a roulette wheel span 26 blacks in a row.<strong>See also:<\/strong> Gambler&#8217;s Fallacy<\/li>\n<li><strong>Muck<\/strong><br \/>\nPoker terminology for folding your cards without them being seen by other players.<\/li>\n<li><strong>Mug \/ Mugging \/ Mug Punting<\/strong><br \/>\nBetting like the average Joe on the street instead of using a system of backs and lays to lock in a profit &#8211; backing without laying. Also used in some instances to reduce the chances of Gubbing at a profitable site. Or, simply, because it matters more when there&#8217;s money on it.<\/li>\n<li><strong>Multiples<\/strong><br \/>\nA bet which contains a series of legs, where each leg is a distinct bet. Every leg of the multiple must win for the multiple to win as a whole.<\/li>\n<\/ul>\n<p><strong>N<\/strong><\/p>\n<ul>\n<li><strong>Nap Bet<\/strong><br \/>\nA tip offered by a tipster that is most expected to win. Often tipsters will post a number of selections that they favour across a horse race meeting, but (usually only) one will be the &#8216;nap&#8217;, the one horse that the tipster favours most to win in the horses associated race.<\/li>\n<li><strong>Net<\/strong><br \/>\nTic Tac for odds of 10\/1.<\/li>\n<li><strong>Neteller<\/strong><br \/>\nNeteller are an ewallet service used by gaming operators to allow users to deposit\/withdraw from their gaming accounts. Not as popular or efficient as Skrill at the time of writing.<strong>See also:<\/strong>Skrill<\/li>\n<li><strong>Neves<\/strong><br \/>\nTic Tac for Odds of 7\/1.<\/li>\n<li><strong>NR \/ Non Runner<\/strong><br \/>\nA selection within an event that does not start for some reason. Primarily refers to a horse withdrawn from a race before it sets off. Bets on NRs are usually voided by the gaming operator, although a noteable exception is in relation to Ante Post betting where NR bets still stand in some instances and can result in a nice bonus for matched bettors.Free bets on NRs are returned at the bookie&#8217;s discretion, refer to the T&amp;C of the bonus in question for more information.<strong>See also:<\/strong>Ante Post<br \/>\n<strong>See also:<\/strong> Void Bets<\/li>\n<\/ul>\n<p><strong>O<\/strong><\/p>\n<ul>\n<li><strong>Odds<\/strong><br \/>\nThe ratio of the probability of something occuring to its not occuring.In gambling terms, odds are commonly referred to as &#8216;the price&#8217; of an outcome.The odds or price reflect the likelihood of an outcome winning and represent the ratio of back to lay stakes (ie to back an outcome at odds of 3\/1 requires £100; to lay that same outcome at 3\/1 requires £300 &#8211; hence the ratio of 3:1).We mentioned above that the odds of an outcome reflect the likelihood of that outcome occuring &#8211; in fact the fractional odds are directly related to the probability of an outcome occuring and can be expressed as the reciprocal of (odds+1) (ie 1\/(odds+1)). Hence if a price on a horse is 3\/1, to calculate the probability of the horse winning one would simply &#8216;flip&#8217; (odds+1) over to make 1\/4 &#8211; ie the horse has a 1 in 4 chance of winning (or 0.25 in decimal\/percentage terms).Additionally, in a perfect market (ie a market where the price on every selection is absolutely accurate), the sum of all probabilities will equal exactly one.This fairly trivial &#8211; albeit slightly technical &#8211; observation should be treated as absolutely invaluable knowledge to the professional APer, and it&#8217;s importance should most certainly NOT be trivialized! It IS the fundamental rule upon which all matched betting is built upon.Why? Well, for calculating arbitrage, knowing that the sum of all probabilities equals one allows you to take a price offered at one bookmaker, run a quick calculation and then know exactly what price the &#8216;other side&#8217; of the bet must be at or better than in order for the arb to be profitable.<strong>See also:<\/strong> True Odds<br \/>\n<strong>See also:<\/strong> Over Round<\/li>\n<li><strong>Odds on<\/strong><br \/>\nExpressed, in fractional terms, as 1\/X (where X is greater than 1). The chance of the result occurring is greater than 50% \/ one in two (ie odds of evens in fractional or 2.0 in decimal).<\/li>\n<li><strong>OddMaker<\/strong>: An oddsmaker is a person who calculates or predicts the outcome of a contest, as in sports or politics, and sets betting odds.<\/li>\n<li><strong>Outsider<\/strong><br \/>\nA Long Shot, someone unlikely to win.<\/li>\n<li><strong>Over \/ Under Bets<\/strong><br \/>\nA wager placed on the number of total &#8216;points&#8217; scored in an event being greater than that set by the bookmaker. Most commonly &#8220;Over \/ Under 2.5 goals&#8221; is a bet on a football match that 3 or more goals will be scored (over 2.5) or 2 or less goals will be scored (under 2.5).Over \/ under bets are very common in most sporting events and for all sorts of actions.<strong>See also:<\/strong>Under<\/li>\n<li><strong>Overlay<\/strong><br \/>\nWhen you lay a bet for more than the stake amount of the Back bet, to result in a greater than average profit if the event in question does NOT happen.Generally this is not a good idea, although in very specific circumstances you may need to overlay to lock in a profit (for example the Bet365 4\/1 promotion).<\/li>\n<li><strong>Over Round<\/strong><br \/>\nThe amount above the True Odds (100%) that the bookmaker has created and the % above the stakes received that they will profit, regardless of the result.In &#8216;technical&#8217; terms, the sum of the reciprocals of all the decimal odds of the selections that constitute the book &#8211; if that sum is greater than 100% then it is &#8216;overround&#8217; and the bookmaker makes a profit if bets are evenly balanced across the book. If the figure is under 100% then the term overround is still used, but it would mean the bookmaker would make a loss if bets were taken evenly across all selections in the book.Used in arbing speak to describe an arb that is profitable &#8211; if the overround on an arb is under 100% then it&#8217;s a profitable arb.<strong>See also:<\/strong>Odds<br \/>\n<strong>See also:<\/strong> True Odds<\/li>\n<\/ul>\n<p><strong>P<\/strong><\/p>\n<ul>\n<li><strong>Palp Bets<\/strong><br \/>\nA palp bet is a bet that was struck between a customer and a bookmaker, but then subsequently cancelled by the bookmaker because of an error in the validity of the bet at the time the bet was struck. Palped bets are a special case of void bet &#8211; palped bets are paid out at decimal odds of 1 (ie only the stake is returned) and the bet is effectively cancelled.Another type of palped bet is a bet where the original price was palpable (erroneous), but instead of the bet being cancelled after it won, the bet was paid out at what the price should have been at the time the bet was placed.Palped bets can be the scourge of the matched bettor because if a back bet is placed by the bettor, then laid off on an exchange, subsequently palped by the bookmaker, but then goes on to win, then the matched bettor will lose the lay liability but not receive any &#8216;back side&#8217; winnings since the bet was palped. As a result a loss equal to the lay liability is incurred on the transaction \/ matched bet. At longer odds this can entail a considerable loss.However very occassionally the converse of the above can hold true in as much as the bookmaker may palp a bet that goes on to lose, in which case a profit equal to the lay liability is made on the matched bet (this is effectively like hitting a half middle).Unfortunately this happens very rarely since bookmakers quite often only palp bets after the event has occured and cynically will settle a palpable bet &#8216;normally&#8217; if it went on to lose &#8211; ie if it is a palpable bet, they will only palp it if it goes on to win (in which case they avoid having to pay out), but if it is a losing bet they will not palp it (in which case you lose the stake as normal).Bookmakers will usually have terms relating to palpable errors in their full Terms and Conditions. The professional matched bettor should take the time to read up on the subject by checking over T&amp;C with at least one bookmaker to understand better what a palpable error is.It is not uncommon to find an arb that is in fact a palpable error &#8211; most usually when the bookmaker has mixed up the odds on two similar but different selections &#8211; ie 1-0 and 0-1, or over 2.5 and under 2.5 etc. In such circumstances it is not good to blindly take these arbs without understanding the risks fully (especially at very long odds): one might consider backing but not laying at all in such circumstances depending on the nature of the bet (ie &#8216;does the bet represent very good value?&#8217; &#8211; if yes then it may be worth punting on this instead of back\/laying it). At the very least one should apply the &#8216;is it too good to be true?&#8217; test &#8211; if the answer is strongly &#8216;yes&#8217;, then caution should be exercised.<strong>See also:<\/strong>Void Bets<\/li>\n<li><strong>Parlay<\/strong><br \/>\nAmerican term for an Accumulator or Multiple or combo bet. It is a type of bet that is dependent on two or more bet winning simulatenously<\/li>\n<\/ul>\n<p><strong> <\/strong><\/p>\n<p><strong>See also:<\/strong> Multiples<\/p>\n<ul>\n<li><strong>Patent<\/strong><br \/>\nA combination bet over 3 selections giving; 3 singles, 3 doubles and 1 treble.<\/li>\n<li><strong>Payout<\/strong><br \/>\nThe return from a Wager.The act of being &#8216;paid out&#8217; by a gaming operator; a withdrawal from a gaming operator.TGT has a forum dedicated to listing payout times, see below.<\/li>\n<li><strong>PayPal<\/strong><br \/>\nE-wallet allowing for the quick and easy transfer of funds to and from service providers.<strong>See also:<\/strong>e-wallet and Skrill<\/li>\n<li><strong>Photo finish<\/strong><br \/>\nA race result that can only be determined by photos taken on the line.<strong>See also:<\/strong>Dead Heat<\/li>\n<li><strong>Pips \/ Ticks<\/strong><br \/>\nPoints on a spread or trading position. In trading &#8216;pips&#8217; usually refer to foreign exchange trading units where the increment from one pricing unit to the next is very small (fractions of decimals). In contrast, &#8216;ticks&#8217; are usually used in instances \/ markets (ie stock trading) where the increment from one pricing unit to the next is larger.Also the number of dots showing on a die or dice (Snake Eyes is two pips).<\/li>\n<li><strong>Place<\/strong><br \/>\nA &#8216;place&#8217; bet is a bet on whether a participant in an event (usually horseracing) will finish within the first few places over the finishing line &#8211; the number of places paid (specified by the bookmaker) will determine the amount paid on each-way bets.For horse racing, the usual &#8216;places&#8217; paid out depend on the number of runners in the race &#8211; they are:<\/p>\n<ul>\n<li>less than 5 runners &#8211; winner only (ie no places are paid out).<\/li>\n<li>5-7 runners &#8211; two places paid at quarter odds (ie 1\/4 of the &#8216;normal&#8217; price that would be paid out on a win only bet).<\/li>\n<li>8-15 runners &#8211; 3 places, quarter odds.<\/li>\n<li>16+ runners &#8211; 4 places, quarter odds.<\/li>\n<li>All other races &#8211; 3 places, fifth odds.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>Occasionally bookmakers will offer promotions in which additional places are paid out (ie for the Grand National, 5 or even 6 places might be paid when 4 is usually the &#8216;norm&#8217;).<\/p>\n<ul>\n<li><strong>Play through requirements<\/strong><br \/>\nThe amount of times a deposit and or bonus must be Wagered prior to a withdrawal being permitted.Better known as &#8216;wagering requirement&#8217; (WR).<strong>See also:<\/strong>Wagering Requirements<\/li>\n<li><strong>Price<\/strong><br \/>\nIn gambling, the odds available on a selection within an event on a market.<strong>See also:<\/strong>Odds<\/li>\n<li><strong>Pony<\/strong><br \/>\nSlang for £25.<\/li>\n<li><strong>Punt<\/strong><br \/>\nA wager, normally small, on an event. Having a punt on something is to place a bet on it.<strong>See also:<\/strong>Mug Punter<\/li>\n<li><strong>Punter<\/strong><br \/>\nThe one placing wagers. Someone having a Punt.<strong>See also:<\/strong>Punt<br \/>\n<strong>See also:<\/strong> Mug Punter<\/li>\n<li><strong>Push<\/strong><br \/>\nA bet where the stake is returned to the bettor because the event that was bet on was drawn or tied and the terms of the bet stated that under such conditions &#8216;all bets are off&#8217;. Most common \/ originated in US betting parlance.<strong>See also:<\/strong>Draw No Bet<br \/>\n<strong>See also:<\/strong> Push Theft<\/li>\n<li><strong>Push Theft<\/strong><br \/>\nThe term used to refer to the case where a bookmaker charges commission on bets that are pushed &#8211; where usually you would simply receive your bet stake back if the event ended in a draw, at such a bookmaker you would have to pay a (normally percentage) amount of your stake in commission.<\/li>\n<\/ul>\n<p><strong>Q<\/strong><\/p>\n<ul>\n<li><strong>Quinella<\/strong><br \/>\nHorse racing term where the better picks the top to horses to cross the line in either order.<strong>See also:<\/strong>Box Betting<\/li>\n<li><strong>Quit while you&#8217;re ahead<\/strong><br \/>\nLinked to &#8220;Gamblers Conceit&#8221;. Wise advice that is difficult for the individual to follow as they have no prerogative to quit while ahead as to be ahead means they are winning and unlikely to leave a Hot Deck or Hot table.<strong>See also:<\/strong>Gamblers Conceit<\/li>\n<\/ul>\n<p><strong>R<\/strong><\/p>\n<ul>\n<li><strong>Racing Post<\/strong><br \/>\nThe finishing line for a race.The Racing Post is also a popular \/ respected horse racing magazine. Can be a great source of offers\/promotions for the APer, particularly around the start of large horse racing festivals like Cheltenham.<\/li>\n<li><strong>Random Number Generator<\/strong><br \/>\nThe system by which the outcomes of casino games are determined. Normally independently verified to ensure there is no bias.Also known by the acronym &#8216;RNG&#8217;.<\/li>\n<li><strong>Ready Reckoner<\/strong><br \/>\nCalculator for working out your betting returns.<\/li>\n<li><strong>Red Mist<\/strong><br \/>\nThe term used to describe the feeling of frustration\/anger\/annoyance at losing, which then contributes to a player &#8217;tilting&#8217; and losing a very large amount of money.<strong>See also:<\/strong>Steam<br \/>\n<strong>See also:<\/strong> Tilt<\/li>\n<li><strong>Regulation<\/strong><br \/>\nOnline betting should only be done in a regulated environment. Regulation does not guarantee security of your funds, but will help with arbitration if you encounter any problems.<\/li>\n<li><strong>Returns<\/strong><br \/>\nThe term &#8216;return&#8217; is generally used in the guides on our site to refer to the profit and loss of a &#8216;matched bet&#8217; &#8211; ie the profit or loss that a back bet, added to the profit or loss of it&#8217;s corresponding lay bet, represents.The use of the term &#8216;returns&#8217; is preferable to using &#8216;profit and loss&#8217; when talking about betting, since &#8216;loss&#8217; is a term that can apply to either the win status of a selection within an event, the win status of a bet, or even the profitability of a bet or series of bets. Add to that the complication of matched betting (whereby if a team loses, your lay bet wins and vice versa), and the term &#8216;loss&#8217; can end up losing(!) it&#8217;s meaning (consider that with a matched bet, you can make a loss on a lay bet but your overall return will be a &#8216;profit&#8217; because your back bet won)!<\/li>\n<li><strong>Re-up<\/strong><br \/>\nIn gambling, an american term for (re)depositing into your account.<\/li>\n<li><strong>Reverse Teaser<\/strong><br \/>\nWhere a customer takes a lower point Spread and is paid out more than evens if it comes in.<strong>See also:<\/strong>Teaser<\/li>\n<\/ul>\n<p><strong>S<\/strong><\/p>\n<ul>\n<li><strong>Scoop6<\/strong><br \/>\nA prize pool where payouts are made based on the correct predictions of six Saturday races. Won by TheGamblingTimes.<\/li>\n<li><strong>Scorecast<\/strong><br \/>\nA bet placed on both the first goal scorer and result.<\/li>\n<li><strong>Scratch<\/strong><br \/>\nRelating to a horse withdrawn before a race. All bets on this horse are voided.<strong>See also:<\/strong> Non Runner<\/li>\n<li><strong>Sharb \/ Sharbing<\/strong><br \/>\nArbitrage using the method of backing at (inflated\/higher shop coupon prices and laying at online exchange prices (usually a lot lower than the shop coupon price). Exploits the fact that shop coupon prices must be &#8216;held&#8217; for quite some time (since they are often quite literally &#8216;printed&#8217; on paper coupons or advertised in shop front hoardings and can&#8217;t be changed as quickly\/easily as online prices), and so in that time the &#8216;real&#8217; price of the selection can drop considerably on the betting exchanges.This is a good example that harks back to the original definition of &#8216;arbitrage&#8217; as being a methodology for making money by exploiting a facet of the betting market&#8217;s &#8216;constitution&#8217; (see the section on Arbitrage for more info).<strong>See also:<\/strong>Arbitrage and Shubbing<\/li>\n<li><strong>Shubbing<\/strong><br \/>\nContraction of the terms &#8216;shop&#8217; and &#8216;gubbing&#8217; &#8211; having your business turned away by a Bricks and Mortar bookmaker. You are no longer able to Sharb as you have been gubbed. Shubbed.<strong>See also:<\/strong>Sharbing and Gubbing<\/li>\n<li><strong>Singles<\/strong><br \/>\nWagers placed on individual selections within an event. Also known as &#8216;Win Singles&#8217; (compare with Multiples or other System \/ Box betting bets).<strong>See also:<\/strong>Multiple<br \/>\n<strong>See also:<\/strong> Box Betting<\/li>\n<li><strong>Skrill<\/strong><br \/>\nSkrill is an e-wallet service favoured by APers\/matched bettors for the speed with which it allows for the transfer of money between gaming operators.Skrill was founded in 2001 under the name &#8216;Moneybookers&#8217;. Moneybookers announced in 2010 that they were to rebrand their company under the new name of &#8216;Skrill&#8217;. At the time of writing, both Skrill and Moneybookers domains are still active, although the branding on the site only refers to Skrill.Skrill is a shortened version of the slang term &#8216;skrilla&#8217;. Both terms refer to the street slang for &#8216;money&#8217;.<strong>See also:<\/strong>PayPal and E-Wallet<\/li>\n<li><strong>Snake Eyes<\/strong><br \/>\nA throw of two dice that results in a total of two, one pip on each die.<strong>See also:<\/strong>Pip<\/li>\n<li><strong>Special Bets<\/strong><br \/>\nNiche bets seen often in-play on next corner, next booking etc.<\/li>\n<li><strong>Sportsman&#8217;s Bet<\/strong><br \/>\nA wager of respect between friends, no money changes hands.<\/li>\n<li><strong>SportBook<\/strong>: A sportsbook is company that accepts bets on sporting events from individual sports bettors.<\/li>\n<li><strong>Spot Fixing<\/strong><br \/>\nFixing individual small outcomes within an event. Associated with the delivery of no balls in cricket and the conceding of throw ins \/ corners in football. Spot fixing is easier to arrange than match fixing as it normally requires only one participant within the match.<strong>See also:<\/strong>Fix<\/li>\n<li><strong>Spread Betting<\/strong><br \/>\nSpread betting can refer to either a financial markets concept in which one buys or sells points on a market, or it can refer to betting on a team to win an event with a handicap of some number of points or goals applied in such a way as to &#8216;even&#8217; the betting distribution\/probabilities\/odds.Financial spread betting extends the concept of buying shares in a company so that one can also sell shares in a company without actually owning the shares in the first place. In a spread betting market, one would either buy or sell points on a binary betting &#8216;selection&#8217;.Financial spread betting is similar to exchange betting &#8211; indeed they are two different manifestations of the &#8216;binary betting&#8217; concept.For more information on Spread betting with handicaps, see the link below for &#8216;Against the Spread and for Asian Handicapping.For more information on the financial system, see the link below for &#8216;Binary Betting&#8217;.<strong>See also:<\/strong>Against the Spread<br \/>\n<strong>See also:<\/strong> Asian Handicapping<br \/>\n<strong>See also:<\/strong> Binary Betting<\/li>\n<\/ul>\n<ul>\n<li><strong>Stake<\/strong><br \/>\nThe amount risked as a wager or bet on an event.For a back bet, the stake is the maximum amount a punter can expect to lose should the bet lose (eg bet £10 on Team1 and if Team1 loses, you lose your £10 stake).For a lay bet, the lay stake is the size of bet that you are prepared to accept from a backer and the corresponding lay liability for that stake is (odds-1)*stake (eg if you accept a lay stake of £10 at odds of 2 decimal, the lay liability is also £10 &#8211; for odds of 3 the lay liability would be £20, etc).<\/li>\n<li><strong>Starting Price<\/strong><br \/>\nUsually refers to horse racing. The Starting Price or &#8216;SP&#8217; of a horse is the price that the horse &#8216;settles at&#8217; when the race starts.Prices can fluctuate greatly right up to the start of the event. If you take a bet at a bookmaker at &#8216;SP&#8217;, it means that the odds you receive will be those that are deemed correct for the horse at the very start of the race, regardless of what the odds were when you placed your wager.<strong>See also:<\/strong>Fixed Odds<\/li>\n<li><strong>Steam<\/strong><br \/>\nUsed to describe a selection whose odds are shortening rapidly. Opposite of &#8220;Drift&#8221;.A selection within an event whose odds are shortening rapidly is known as a &#8216;steam line&#8217;.Example: the odds on Arsenal are steaming in.Also used to describe a state of anger, normally considered to be a step above a &#8220;Tilt&#8221;.<strong>Compare:<\/strong>Drift<br \/>\n<strong>See also:<\/strong> Arb<\/li>\n<li><strong>Super Heinz<\/strong><br \/>\nA combination bet over 7 selections giving; 21 doubles, 35 trebles, 35 four folds, 21 five folds, 7 six folds and 1 seven fold (120 bets in total).<\/li>\n<li><strong>Super Yankee (Canadian)<\/strong><br \/>\nA Yankee bet with five selections instead of four providing; 10 doubles, 10 trebles, 5 fourfolds and a fivefold.<\/li>\n<li><strong>System Bet<\/strong><br \/>\nA system bet is a bet which comprises a number of separate selections on the same betting slip which constitute a number of accumulator or multiple bets. See Box Betting for more info.<strong>See also:<\/strong>Box Betting<\/li>\n<\/ul>\n<p><strong>T<\/strong><\/p>\n<ul>\n<li><strong>Target Betting<\/strong><br \/>\nAn advanced (and very high risk) betting strategy employed with the purpose of completing a wagering requirement more efficiently \/ with greater expected value (but at greater risk to one&#8217;s bankroll). Most commonly applies to casino wagering requirements.The basic concept of target betting is that one places very large (often full balance) bets at the start of betting session with the aim of hitting a certain &#8216;target&#8217; balance quickly (and in the process making the value of the bonus a lot greater). Once the target balance is reached, the remainder of the wagering requirement is completed on minimal risk bets to avoid losing too much of the (now much greater) potential profit.There are several advantages to this technique which mean that target betting can increase the expected value of a bonus &#8211; in theory at least. However care must be taken to ensure that the risks of the strategy are fully understood and that the strategy is suitable for the particular wagering campaign one is about to undertake (for example it is not (as) suitable for a post wager casino bonus campaign).<strong>Also known as:<\/strong>&#8216;<em>tier or tiered betting&#8217;<\/em>.<br \/>\n<strong>See also:<\/strong> Betting Strategy<br \/>\n<strong>See also:<\/strong> Expected Value<br \/>\n<strong>See also:<\/strong> Wagering Requirement<\/li>\n<li><strong>Teaser<\/strong><br \/>\nAmerican term for taking a more favourable point spread and therefore lowering the evens pay-out. Also known as &#8216;buying points (on the spread)&#8217;<strong>See also:<\/strong>Reverse Teaser<\/li>\n<li><strong>TheGamblingTimes<\/strong><br \/>\nThe finest sports betting reviews, news, offers and forum on net. The home of Value Betting.<\/li>\n<li><strong>Tic Tac<\/strong><br \/>\nA form of sign language used by bookmakers to convey odds\/prices on horses in an environment where vocal use alone is insufficient (ie on race courses, noise is often very high and so using sign language saves the on course bookmaker from losing his voice).<\/li>\n<li><strong>Tick<\/strong><br \/>\nSee:Pips \/ Ticks<\/li>\n<li><strong>Tilt<\/strong><br \/>\nMental frustration normally linked to poker where a player will stop using optimal play. A tilt is often caused by a bad beat, or general annoyance with other players. Also, in general gambling parlance, refers to the act of blowing a large amount of money in a relatively short space of time as a result of frustration\/anger at losing bet(s).<strong>See also:<\/strong>Steam<br \/>\n<strong>See also:<\/strong> Red Mist<\/li>\n<li><strong>Tip<\/strong><br \/>\nThe offering of a suggested wager. Someone charging for this advice is a tipster.<strong>See also:<\/strong>Nap<\/li>\n<li><strong>Tipster<\/strong><br \/>\nSomeone who charges for their recommendations on wagers.<\/li>\n<li><strong>Ton<\/strong><br \/>\nSlang for £100.<\/li>\n<li><strong>Toss Up<\/strong><br \/>\nAn event with two participants where either participant could win. Odds would be Evens \/ 2 decimal. Refers to the odds of tossing heads or tails in a coin flip.<\/li>\n<li><strong>Tote<\/strong><br \/>\nShortened version of the term &#8220;Totalisator&#8221;. A &#8220;Tote&#8221; is a system for adding up all bets placed on a pari-mutuel betting market and displaying the associated &#8216;odds&#8217; (referred to commonly as &#8216;dividends&#8217; on a tote market) for each selection in the event.In a pari-mutuel \/ tote market, all bets are pooled (all bets go into one big &#8216;pot&#8217;), and the odds or dividends are calculated based on a share of the pool going to all winning bets.<strong>See also:<\/strong>Scoop 6<\/li>\n<li><strong>Trading<\/strong><br \/>\nPlacing backs and lays either on exchanges, or between bookmakers and exchanges, and attempting to make a profit, regardless of the result, through the movement in the odds prior and during the event.<strong>See also:<\/strong>Market Maker<\/li>\n<li><strong>Treble<\/strong><br \/>\nAn accumulator made up of three selections, all of which need to win for a payment to be made.<strong>See also:<\/strong>Multiples<\/li>\n<li><strong>Trends<\/strong><br \/>\nSee Form.<\/li>\n<li><strong>Tri-cast<\/strong><br \/>\nA bet predicting the first, second and third places in an event, normally a horse or dog race, in the correct order.<\/li>\n<li><strong>True odds<\/strong><br \/>\nThe actual likelihood of an outcome occurring. Different to the odds provided by a bookmaker to ensure they make a profit regardless of the outcome.<strong>See also:<\/strong>Odds<\/li>\n<li><strong>Turf Accountant<\/strong><br \/>\nA racecourse bookmaker.<\/li>\n<\/ul>\n<p><strong>U<\/strong><\/p>\n<ul>\n<li><strong>Underdog<\/strong><br \/>\nWhoever is not the favourite in an event.<\/li>\n<li><strong>Under<\/strong><br \/>\n<strong>See:<\/strong>Over \/ Under Bets<\/li>\n<li><strong>Underlay<\/strong><br \/>\nA term used to refer to a matched bet where you do not lay your initial bet off completely.<strong>See also:<\/strong>Overlay<\/li>\n<\/ul>\n<p><strong>V<\/strong><\/p>\n<ul>\n<li><strong>Vegas Odds<\/strong><br \/>\n<strong>See:<\/strong>American Odds<\/li>\n<li><strong>Value betting<\/strong><br \/>\nBetting on events where the payout is greater than the probability of the event occurring, the most simplistic example being betting 1 unit on the toss of a coin and if it wins being paid 11\/10 (or 2.1 decimal), or anything over Evens (2s) really. There is no certainty you will profit from that bet &#8211; you could lose ten in a row, it is not impossible to lose 100 in a row &#8211; but statistically you should win half, and your payout will in the long run be greater than the losses, so the bet is &#8220;Value&#8221;.<strong>See also:<\/strong>Advantage Play<\/li>\n<li><strong>Variance<\/strong><br \/>\nThe change in your bankroll over time away from the Expected value (or EV) which it should follow. For example if you have 100 credits and play 185 spins of Roulette betting 1 unit on Red each time you should end with 95 due to the house edge. The fact at times your balance may be as high as 110 and as low as 85 is the &#8220;variance&#8221; away from the trend line.The term variance is also used in AP to refer to the &#8216;variability&#8217; of a particular type of gambling or type of game &#8211; for example slot machines are referred to as &#8216;high variance&#8217; because it can be possible to see very large swings either side of the &#8216;average&#8217; return expected (ie wagered amount less house edge), whereas other games such as Blackjack and Roulette are classed as low variance since the swings experienced will be a lot less pronounced. In this respect, variance is closely linked to risk &#8211; the higher the variance of a game, the more risk there is of busting your bankroll and vice versa for low variance games.This difference in variance and the associated risk between games can be exploited by the APer to undertake lengthy wagering sessions on low variance games so as to not risk losing too much of your initial bank roll whilst completing the wagering requirement. In response to this, casinos now tend to &#8216;weight&#8217; the contribution that wagering on certain types of games make to a wagering requirement &#8211; so for example it is not uncommon now to see games that can be played in a low risk way (such as Roulette) be weighted at a very low level &#8211; eg 10% &#8211; so that only 10% of all wagers actually count towards the wagering requirement (in effect this multiplies the wagering requirement by 10 if you decide to only use that game to complete the WR).As always it is imperative to check the T&amp;C fully before underaking a WR to ensure that value or EV of the bonus is worthwhile (ie, that the bonus wagering can be completed using a certain staking method\/game in such a way that on average you can expect to make a profit). See the TGT artcle below regarding calculating bonus EV for more information.<\/li>\n<li><strong>Vig (Vigorish)<\/strong><br \/>\nYidish slang used for bookmaker commission. A process whereby the bookmaker will make money on the wagers they take, regardless of the outcome of the event.<strong>See also:<\/strong>Over Round<br \/>\n<strong>See also:<\/strong> Juice<br \/>\n<strong>See also:<\/strong> Book Making<\/li>\n<li><strong>Void Bet<\/strong><br \/>\nA void bet is a bet that is paid out at decimal odds of 1 &#8211; ie only the stake is returned and effectively the bet is cancelled. A bet can be voided for various reason, most usually if the selection that is bet on is a non-runner or if the bet was struck in error (in which case it is referred to as a &#8216;palpable error&#8217;, a &#8216;palp&#8217;, or a &#8216;palped bet&#8217;).<strong>See also:<\/strong>Palp<br \/>\n<strong>See also:<\/strong> Non Runner<\/li>\n<\/ul>\n<p><strong>W<\/strong><\/p>\n<ul>\n<li><strong>Wager<\/strong><br \/>\nThe stake placed on the outcome of an event. A bet placed on an outcome of an event.<strong>See also:<\/strong>Betting<\/li>\n<li><strong>Wagering Requirements<\/strong><br \/>\nAmount of Play-through required in order to convert a bonus to withdrawable cash.Most bonuses offered by gaming operators are subject to terms and conditions which define at what point the bonus can be withdrawn. The primary condition tied to most bonuses is that a certain amount of &#8216;wagering&#8217; must be completed before the bonus can be withdrawn &#8211; this is &#8216;the wagering requirement&#8217; of the bonus (commonly referred to in abbreviation as &#8216;WR&#8217;).The WR is usually expressed in multiples of the bonus and\/or deposited amount, and denoted accordingly NxB or Nx(D+B), where N is the multiplier, D is the deposited amount and B is the bonus amount.For example a bonus with a wagering requirement of 5xB means the bonus amount must be &#8216;turned over&#8217; or &#8216;wagered through&#8217; five times before it can be withdrawn. A bonus with a 5x(D+B) WR means the deposit AND bonus amounts must be wagered five times before the bonus can be withdrawn.The use of &#8216;D+B&#8217; in WR terms can be an underhand way for gaming operators to increase the amount of wagering that must be completed before a bonus can be withdrawn, whilst on the face of it in the basic promotional material making the bonus sound a lot more generous.For example consider the wording: &#8220;Get our great 5% bonus up to £100 with only 5x wagering!!!&#8221; &#8211; this is slightly disingenuous if it turns out that in the small print the actual WR is 5x(D+B), since to get\/release\/withdraw the full £100 bonus you would first have to deposit £2,000, meaning the actual WR is 5x(2,000+100)=£10,500 &#8211; an eye popping (and most likely -EV) 105x WR!).As always it is very important to read the T&amp;C fully, and to calculate the expected value (EV) of a bonus. A key element of this is translating any &#8216;D+B&#8217; wagering requirement into simple &#8216;B&#8217; terms (ie in the example above, converting the 5x(D+B) into 105xB).See the article linked to below for more information on calculating EV.<strong>See also:<\/strong>Bonus<\/li>\n<li><strong>Welch<\/strong><br \/>\nFailure to settle a gambling debt.<\/li>\n<li><strong>Whale<\/strong><br \/>\nTerm for someone who has the bankroll to place large wagers (normally casino) and lose correspondingly large amounts.<strong>See also:<\/strong>Big Player<\/li>\n<li><strong>Winning margin<\/strong><br \/>\nDistance by which the winner was ahead of the runner-up. Usually refers to horse racing.<\/li>\n<\/ul>\n<p><strong>X<\/strong><\/p>\n<ul>\n<li><strong>X<\/strong><br \/>\nA &#8216;Draw&#8217; on football coupons &#8211; ie 0-0, 1-1, etc.<\/li>\n<\/ul>\n<p><strong>Y<\/strong><\/p>\n<ul>\n<li><strong>Yankee<\/strong><br \/>\nA combination bet over 4 selections giving; 6 doubles, 4 trebles and a fourfold accumulator.<\/li>\n<\/ul>\n<p><strong>Z<\/strong><\/p>\n<p><strong>Zone<\/strong><br \/>\nIn the zone, a zen like state where a sportsman,<\/p>\n<p>There you have it. A complete A-Z of the top betting terms every tipster and punters should be familiar with. Do you think we miss any online betting glossary? Feel free to share in the comments.<\/p>\n<p>PS: Love to write for us? Submit a <a href=\"https:\/\/www.betensured.com\/write-for-us.php\">guest post<\/a> here<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As a Football Prediction Site, we know soccer betting is hard but it can get harder if you are not familiar with your betting terms What Betensured hopes to achieve is to collect a complete list of the A-Z of betting terms that will help both the pro and the layman stay in the know. Think [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":4021,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":""},"categories":[7],"tags":[],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/www.betensured.com\/blog\/wp-content\/uploads\/2018\/12\/betting-terminology.jpg?fit=1280%2C850&ssl=1","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Betting Terms - The Complete Sports Betting Terms | Betensured<\/title>\n<meta name=\"description\" content=\"Sports betting termed explained. This list contains over 200 sports betting glossary you definitely need to know to be a successful gambler\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.betensured.com\/blog\/betting-terms\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Betting Terms - The Complete Sports Betting Terms | Betensured\" \/>\n<meta property=\"og:description\" content=\"Sports betting termed explained. This list contains over 200 sports betting glossary you definitely need to know to be a successful gambler\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.betensured.com\/blog\/betting-terms\/\" \/>\n<meta property=\"og:site_name\" content=\"Betensured\" \/>\n<meta property=\"article:publisher\" content=\"http:\/\/www.facebook.com\/betensured\" \/>\n<meta property=\"article:published_time\" content=\"2019-03-13T04:10:22+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-22T02:29:55+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/www.betensured.com\/blog\/wp-content\/uploads\/2018\/12\/betting-terminology.jpg?fit=1280%2C850&#038;ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"850\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@betensured\" \/>\n<meta name=\"twitter:site\" content=\"@betensured\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.betensured.com\/blog\/#organization\",\"name\":\"Betensured\",\"url\":\"https:\/\/www.betensured.com\/blog\/\",\"sameAs\":[\"http:\/\/www.facebook.com\/betensured\",\"https:\/\/twitter.com\/betensured\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.betensured.com\/blog\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i0.wp.com\/www.betensured.com\/blog\/wp-content\/uploads\/2015\/07\/betensured.png?fit=2171%2C2171&ssl=1\",\"width\":2171,\"height\":2171,\"caption\":\"Betensured\"},\"image\":{\"@id\":\"https:\/\/www.betensured.com\/blog\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.betensured.com\/blog\/#website\",\"url\":\"https:\/\/www.betensured.com\/blog\/\",\"name\":\"Betensured\",\"description\":\"Betensured\",\"publisher\":{\"@id\":\"https:\/\/www.betensured.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.betensured.com\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.betensured.com\/blog\/betting-terms\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/i0.wp.com\/www.betensured.com\/blog\/wp-content\/uploads\/2018\/12\/betting-terminology.jpg?fit=1280%2C850&ssl=1\",\"width\":1280,\"height\":850,\"caption\":\"sports betting terms explained\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.betensured.com\/blog\/betting-terms\/#webpage\",\"url\":\"https:\/\/www.betensured.com\/blog\/betting-terms\/\",\"name\":\"Betting Terms - The Complete Sports Betting Terms | Betensured\",\"isPartOf\":{\"@id\":\"https:\/\/www.betensured.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.betensured.com\/blog\/betting-terms\/#primaryimage\"},\"datePublished\":\"2019-03-13T04:10:22+00:00\",\"dateModified\":\"2020-06-22T02:29:55+00:00\",\"description\":\"Sports betting termed explained. This list contains over 200 sports betting glossary you definitely need to know to be a successful gambler\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.betensured.com\/blog\/betting-terms\/\"]}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/www.betensured.com\/blog\/betting-terms\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.betensured.com\/blog\/betting-terms\/#webpage\"},\"author\":{\"@id\":\"https:\/\/www.betensured.com\/blog\/#\/schema\/person\/617df5000ae4af22028095624ca62e0f\"},\"headline\":\"Betting Terms &#8211; The Complete Sports Betting Terms\",\"datePublished\":\"2019-03-13T04:10:22+00:00\",\"dateModified\":\"2020-06-22T02:29:55+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.betensured.com\/blog\/betting-terms\/#webpage\"},\"commentCount\":1,\"publisher\":{\"@id\":\"https:\/\/www.betensured.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.betensured.com\/blog\/betting-terms\/#primaryimage\"},\"articleSection\":\"Betting Tips\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.betensured.com\/blog\/betting-terms\/#respond\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.betensured.com\/blog\/#\/schema\/person\/617df5000ae4af22028095624ca62e0f\",\"name\":\"Betensured\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.betensured.com\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/ebd48dd495c6db9ba553142621a388af?s=96&d=mm&r=g\",\"caption\":\"Betensured\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_shortlink":"https:\/\/wp.me\/p6Q0JM-12Q","jetpack-related-posts":[{"id":3527,"url":"https:\/\/www.betensured.com\/blog\/football-betting-guide\/","url_meta":{"origin":4020,"position":0},"title":"The Complete Football Betting Guide for Beginners","date":"February 13, 2018","format":false,"excerpt":"  Intereted in learning about sports bettings? Then read this football betting guide we carefully put together. Betting, especially football betting, has come a long way and it has come to stay. Now people don’t just go to games to watch their favorite team win, but many people watch football…","rel":"","context":"In &quot;Betting Tips&quot;","img":{"alt_text":"football betting guide for beginners","src":"https:\/\/i2.wp.com\/www.betensured.com\/blog\/wp-content\/uploads\/2018\/02\/football-betting-guide.png?fit=1024%2C512&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":4800,"url":"https:\/\/www.betensured.com\/blog\/fantasy-betting\/","url_meta":{"origin":4020,"position":1},"title":"Fantasy Betting 2021: A Complete Guide to Fantasy Sports Betting","date":"June 26, 2020","format":false,"excerpt":"With the success of traditional sports business and the amount of financial revenue it generates, efforts have been made to find an alternative system of betting. One that will be easier to play without removing any of the fun. In 1980, fantasy betting was introduced to sports-loving gamblers and the…","rel":"","context":"In &quot;Sports Betting&quot;","img":{"alt_text":"the complete guide to fantasy sports betting","src":"https:\/\/i0.wp.com\/www.betensured.com\/blog\/wp-content\/uploads\/2020\/06\/fantasy-betting-complete.png?fit=750%2C375&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":3547,"url":"https:\/\/www.betensured.com\/blog\/best-football-betting-advice-you-should-never-ignore\/","url_meta":{"origin":4020,"position":2},"title":"13 Best Football Betting Advice You Should Never Ignore","date":"April 8, 2018","format":false,"excerpt":"  What is the best football betting advice? If you are a beginner or an experienced punter, there is need to keep up with what is working in sports betting and how to make money betting on football. Unfortunately, while there are a lot of sites out there that promised…","rel":"","context":"In &quot;Betting Tips&quot;","img":{"alt_text":"best betting advice","src":"https:\/\/i1.wp.com\/www.betensured.com\/blog\/wp-content\/uploads\/2018\/04\/13-betting-advice-ignore.png?fit=1024%2C512&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":5050,"url":"https:\/\/www.betensured.com\/blog\/best-betting-sites-with-high-odds\/","url_meta":{"origin":4020,"position":3},"title":"Best Betting Sites With High Odds","date":"December 24, 2020","format":false,"excerpt":"Have you ever gambled online before? How often do you bet on sports? These days, there is an increased interest in sports betting, primarily because there is a high chance for sports enthusiasts, to win prizes for it, and earn extra income from it. Sports betting is the easiest way…","rel":"","context":"In &quot;Betting Tips&quot;","img":{"alt_text":"betting sites with high odds","src":"https:\/\/i2.wp.com\/www.betensured.com\/blog\/wp-content\/uploads\/2020\/12\/best-sites-in-nigeria-with-highest-odds.png?fit=750%2C375&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]},{"id":4860,"url":"https:\/\/www.betensured.com\/blog\/which-are-the-most-profitable-betting-markets-in-football\/","url_meta":{"origin":4020,"position":4},"title":"Which Are the Most Profitable Betting Markets in Football","date":"July 31, 2020","format":false,"excerpt":"When it comes to the profusion of betting opportunities sports provide, there are no two ways about it that football is hard to beat. It is hardly surprising that football attracts such staggering viewership as matches take place almost on a daily basis, thus providing gambling enthusiasts with a nearly…","rel":"","context":"Similar post","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/www.betensured.com\/blog\/wp-content\/uploads\/2020\/07\/football-1274661_1920.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":4602,"url":"https:\/\/www.betensured.com\/blog\/virtual-football-betting\/","url_meta":{"origin":4020,"position":5},"title":"Virtual Football: The Guide to Virtual Football Betting","date":"December 22, 2019","format":false,"excerpt":"Betting among the teeming population around the world is now a source of income that people indulge in, mostly as a side hustle. The question asked by most punters and would-be punters is what is the best way to make money via betting? Many believe betting on live matches is…","rel":"","context":"In &quot;Betting Tips&quot;","img":{"alt_text":"virtual football betting","src":"https:\/\/i2.wp.com\/www.betensured.com\/blog\/wp-content\/uploads\/2019\/12\/Virtual-Football-Betting_-The-Complete-Guide..png?fit=750%2C375&ssl=1&resize=350%2C200","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/www.betensured.com\/blog\/wp-json\/wp\/v2\/posts\/4020"}],"collection":[{"href":"https:\/\/www.betensured.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.betensured.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.betensured.com\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.betensured.com\/blog\/wp-json\/wp\/v2\/comments?post=4020"}],"version-history":[{"count":11,"href":"https:\/\/www.betensured.com\/blog\/wp-json\/wp\/v2\/posts\/4020\/revisions"}],"predecessor-version":[{"id":4731,"href":"https:\/\/www.betensured.com\/blog\/wp-json\/wp\/v2\/posts\/4020\/revisions\/4731"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.betensured.com\/blog\/wp-json\/wp\/v2\/media\/4021"}],"wp:attachment":[{"href":"https:\/\/www.betensured.com\/blog\/wp-json\/wp\/v2\/media?parent=4020"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.betensured.com\/blog\/wp-json\/wp\/v2\/categories?post=4020"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.betensured.com\/blog\/wp-json\/wp\/v2\/tags?post=4020"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}